import { getServerSession } from '#auth'
import request from 'request'
const config = useRuntimeConfig()
const proxy = config.CHANGING_PROXY
const elPerPage = 50
const apiKey = config.serverLoadApiKey

export default eventHandler(async (event) => {
  const session = (await getServerSession(event)) as any
  if (!session) return sendRedirect(event, '/auth', 302)

  const { article, limit, page } = getQuery(event)

  if (!article) {
    return send(event, {
      status: 400,
      body: 'Article is required',
    })
  }

  // const data: any = await $fetch('http://95.163.249.133:4141', {
  //   method: 'POST',
  //   parseResponse: JSON.parse,
  //   body: {
  //     type: 'ozonReviews',
  //     url: `https://www.ozon.ru/product/${article}/`,
  //     count: elPerPage,
  //   },
  // })

  // if (!data || data.status === 'error') {
  //   return {
  //     feedbacks: [],
  //     feedbacksCount: 0,
  //   }
  // }
  const data = [
    {
        "id": "018ec3ca-1944-9b2a-a3df-e6f608aa9b02",
        "rating": 2,
        "text": "Кофеварка пришла с бракованным баком для воды,из за этого бачок плохо прилегает к кофеварке,из хорошего внешний вид и не громозкость,к сожалению возврат.",
        "positiveText": "",
        "negativeText": "",
        "user": {
            "name": "елена",
            "country": "Россия"
        },
        "likes": 0,
        "dislikes": 0,
        "comments": [],
        "rank": 1
    },
    {
        "id": "018ec7fa-90dd-8bbf-4eac-22df8b4fc7f5",
        "rating": 5,
        "text": "Хорошая, работает, нареканий нет)",
        "positiveText": "",
        "negativeText": "",
        "user": {
            "name": "Дария С.",
            "country": "Россия"
        },
        "likes": 0,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ec818-efd4-bfee-df97-d5ce482dea69",
                "text": "Добрый день! Благодарим за отзыв и высокую оценку нашего товара. Нам приятно, что у Вас сложилось позитивное мнение о нем. Команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 2
    },
    {
        "id": "018ec6dd-3706-545f-1acd-2f32f93c5746",
        "rating": 4,
        "text": "За свои деньги отлично",
        "positiveText": "",
        "negativeText": "",
        "user": {
            "name": "Владимир С.",
            "country": "Россия"
        },
        "likes": 0,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ec6fa-b730-fe6f-bd1a-24e3fb0f8d0b",
                "text": "Добрый день! Спасибо вам за оставленный отзыв, он помогает нам становиться лучше. С уважением, команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 3
    },
    {
        "id": "018ec675-4e5b-beca-b8c3-9966913f0adf",
        "rating": 5,
        "text": "Достойная машинка за такие деньги. Из-за наличия дома кофемолки, необходимости в полноценном кофейном комбайне не было, поэтому рассмотрели данную модель. Компактная, даже миниатюрная, универсальная-кроме капсул есть возможность готовить самим молотый кофе. Потихоньку осваиваем -подбираем пропорции, время приготовления и тд .К покупке рекомендую!",
        "positiveText": "Компактность",
        "negativeText": "Нет",
        "user": {
            "name": "Р Х.",
            "country": "Россия"
        },
        "likes": 0,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ec68f-d17b-60b1-fb11-b7ff24de0389",
                "text": "Добрый день! Благодарим за отзыв и высокую оценку нашего товара. Нам приятно, что у Вас сложилось позитивное мнение о нем. Команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 4
    },
    {
        "id": "018ec30c-0672-7aa6-a307-fff1c085a221",
        "rating": 5,
        "text": "Как мне показалось шумная, а так все норм.",
        "positiveText": "",
        "negativeText": "",
        "user": {
            "name": "Мария В.",
            "country": "Россия"
        },
        "likes": 0,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ec316-d377-90b6-a2d8-80c1dd8993be",
                "text": "Добрый день! Благодарим за отзыв и высокую оценку нашего товара. Нам приятно, что у Вас сложилось позитивное мнение о нем. Команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 5
    },
    {
        "id": "018ec2e4-3d99-486b-91a7-88e34c31bdbe",
        "rating": 5,
        "text": "Из-за большой любви к свежесваренному кофе решили приобрести кофемашину. Встал вопрос о том, какие капсулы будут использоваться чаще, но после обсуждений поняли, что и nespresso (большой выбор эспрессо со всевозможными вкусами), и dolce gusto (куча видов капучино, латте, горячего шоколада и т.д) необходимы в равных количествах. Данная модель прекрасно решила этот вопрос, пользуемся с большой радостью! Товар пришел без брака, инструкция более чем понятна, порадовала возможность использовать кофемашину в формате «конвейера». Пока один выбрасывает капсулу, другой уже сварил себе кофе с другим типом капсул, по утрам нет лишних трат времени, которого и так не хватает:)",
        "positiveText": "",
        "negativeText": "",
        "user": {
            "name": "Алексей П.",
            "country": "Россия"
        },
        "likes": 0,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ec2f4-fd5a-c42d-3972-aae9c4143cd7",
                "text": "Добрый день! Большое спасибо за оставленный отзыв! Нам приятно, что наша техника радует Вас. Команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 6
    },
    {
        "id": "018ec256-c26a-70dc-d907-f6127c656154",
        "rating": 5,
        "text": "Рассматривала другую модель, но подвернулась скидка и купила Kt-7105. Малышка огонь! Маленькая, но со своей работой справляется на отлично: быстро, просто, горячо, ароматно и вкусно одновременно, да еще и с пеночкой. внешне совсем не выглядит дешевой. Даже на маленькой кухне есть куда поставить. Как работает понятно интуитивно, есть подробная инструкция. Кофе получается не хуже, чем в автоматических домашних машинах. Ребенок особенно рад какао. Есть маленький минус – не лезет большая чашка, но средняя вполне, если снять поддон, то чашку желательно придерживать, может соскользнуть, поэтому средняя на поддоне – идеально. Капсулы самые распространенные (Dolche gusto,Nespresso), соответственно не дорогие и разнообразные, поэтому с молотым не пробовала.  Покупкой довольна очень (не дорого и сердито). Советую! Фото для наглядности размкра рядом с чайником",
        "positiveText": "",
        "negativeText": "",
        "user": {
            "name": "Юлия А.",
            "country": "Россия"
        },
        "likes": 0,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ec267-e272-43c7-d173-cfcc63a2ce69",
                "text": "Добрый день! Благодарим за отзыв и высокую оценку нашего товара. Нам приятно, что у Вас сложилось позитивное мнение о нем. Команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 7
    },
    {
        "id": "018ebda3-e490-0963-7bea-c1aa5cc90a67",
        "rating": 5,
        "text": "Давно хотел такую. Выбирал долго.Что сказать, я доволен, члены семьи тоже, теперь мы с супругой пьём вкусный кофе,дети какао из капсул, быстро, без лишних движений, что немаловажно подходят 2 вида капсул, также есть адаптер для молотого. Из недостатков, можно придраться к маленькому объёму ёмкости для воды.",
        "positiveText": "",
        "negativeText": "",
        "user": {
            "name": "Алексей С.",
            "country": "Россия"
        },
        "likes": 0,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ec45f-d172-9547-338e-443209167a78",
                "text": "Добрый день! Большое спасибо за оставленный отзыв! Нам приятно, что наша техника радует Вас. Команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 8
    },
    {
        "id": "018ec221-a27f-0f64-2d3c-c9aec44f8e9d",
        "rating": 5,
        "text": "Кофеварка выглядит стильно и компактно. Выполнена из качественного материала. Простая и удобная в  использовании. Кофе варит вкусное",
        "positiveText": "",
        "negativeText": "",
        "user": {
            "name": "Александр Г.",
            "country": "Россия"
        },
        "likes": 0,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ec24a-d4af-d9a7-15a3-095419bf67d5",
                "text": "Добрый день! Большое спасибо за оставленный отзыв! Нам приятно, что наша техника радует Вас. Команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 9
    },
    {
        "id": "018ebd8e-e03d-0ee8-998d-6109525206e9",
        "rating": 5,
        "text": "Капсульная кофемашина Kitfort — это прям спасение для тех, кто не представляет утро без кофе, но не любит возиться с долгим приготовлением. Всё просто: кинул капсулку, жмакнул кнопку и вот тебе уже ароматный кофе стоит, готовый разбудить. А размерчик такой маленький, что даже на моей крошечной кухоньке нашлось местечко, не пришлось ничего переставлять. Для тех, кто ценит каждую минуту и не хочет заморачиваться с сложными устройствами — самое то!",
        "positiveText": "размер, качество",
        "negativeText": "цветовая линейка (можно больше практичных цветов)",
        "user": {
            "name": "Ирина Я.",
            "country": "Россия"
        },
        "likes": 1,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ebee9-9aa0-99fc-1c35-db5633d04952",
                "text": "Добрый день! Большое спасибо за оставленный отзыв! Нам приятно, что наша техника радует Вас. Команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 10
    },
    {
        "id": "018ebd38-e68b-db50-6035-028af702165e",
        "rating": 5,
        "text": "Очень вкусный кофе, главное быстро. Не замороченый уход, взял жене на работу, она довольна, докупил капучинатор. Ей экономит время и деньги. Подходят капсулы разного типа : дольче густо, неспрессо, или можно просто молотый туда насыпать, ро мы пока не пробовали. Это первая капсульная машина, покупкой довольны.",
        "positiveText": "",
        "negativeText": "",
        "user": {
            "name": "Дмитрий Н.",
            "country": "Россия"
        },
        "likes": 0,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ebd53-2794-69ef-816a-12151daecbff",
                "text": "Добрый день! Большое спасибо за оставленный отзыв! Нам приятно, что наша техника радует Вас. Команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 11
    },
    {
        "id": "018ebd74-7b2e-9b1a-881a-2cc450f26673",
        "rating": 5,
        "text": "Прошла неделя активного использования кофеварки. Очень достойная машинка за столь маленькую цену. Молотый кофе - отлично! Капсулы Dolche gusto - шикарно. Начитавшись отзывов, боялась пробовать капсулы Nespresso, но и с ними не возникло никаких проблем. \nЕдинственным минусом могу выделить недостаток места для кружки. Помещается только очень маленькая. Даже если убрать поддон, асе равно неудобно, приходится держать рукой, чтобы не упала.",
        "positiveText": "",
        "negativeText": "",
        "user": {
            "name": "Наталья Б.",
            "country": "Россия"
        },
        "likes": 1,
        "dislikes": 0,
        "comments": [
            {
                "id": "018ebf07-1c50-72b4-a8f2-d57e80950883",
                "text": "Добрый день! Благодарим за отзыв и высокую оценку нашего товара. Нам приятно, что у Вас сложилось позитивное мнение о нем. Команда Kitfort.",
                "user": {
                    "name": "KITFORT",
                    "country": "Россия"
                },
                "likes": 0,
                "dislikes": 0,
                "rank": 1
            }
        ],
        "rank": 12
    }
]

  data.forEach((feedback: any) => {
    feedback.comments.forEach((comment: any) => {
      comment.addLikes = 0
      comment.addDislikes = 0
    })
  })


  return {
    feedbacks: data,
    feedbacksCount: 0,
  }
})
