<script setup lang="ts">
const { notify } = useNotification();
import type { Rule } from "@/data/buyout/rules";
const { user }: any = useUserSession();
const props = defineProps({
  product: {
    type: Object as any,
    required: true,
  },
  index: {
    type: Number,
    required: true,
  },
  loading: {
    type: Boolean,
    required: true,
  },
  openPromo: {
    type: Function,
    required: true,
  },
});

const emit = defineEmits([
  "callback",
  "pointModalOpen",
  "ruleModalOpen",
  "removePromo",
]);

const startDate = ref(new Date(Date.now() + 1000 * 60 * 5));

const store = useYandexMarketBuyoutStore();

function copyBuyout() {
  if (store.createProducts.length >= 10) {
    notify({
      title: "За раз можно создать максимум 10 выкупов",
      group: "error",
    });
    return;
  }

  const item = JSON.stringify(store.createProducts[props.index]);
  store.createProducts.push(JSON.parse(item));
}
async function deleteBuyOut() {
  store.removeProduct(props.index);
}
function onSizeChange(event: Event) {
  const target = event.target as HTMLInputElement;
  store.changeSize(target.value, props.index);
}
function onSexChange(event: Event) {
  const target = event.target as HTMLInputElement;
  store.changeSex(target.value, props.index);
}

function removeSearchQuery(index: number) {
  store.removeSearchQuery(props.index, index);
}
function addSearchQuery() {
  store.addSearchQuery(props.index);
}
function productSearchQueryUpdate(event: Event, index: number) {
  const newValue = (event.target as HTMLInputElement).value;
  store.changeSearchQuery({
    value: newValue,
    queryIndex: index,
    productIndex: props.index,
  });
}
const productDateRangeModel = computed({
  get() {
    return props.product.dateRange;
  },
  set(newValue: unknown[]) {
    store.changeDateRange(newValue, props.index);
  },
});

const productQuantityModel = computed({
  get() {
    return props.product.quantity;
  },
  set(newValue: number) {
    store.changeQuantity(newValue, props.index);
  },
});

const categories = ref([
  {
    name: "Одежда и обувь",
    subcategories: [
      {
        name: "Обувь",
        subcategories: [
          {
            name: "Женская обувь",
          },
          {
            name: "Мужская обувь",
          },
          {
            name: "Для девочек",
          },
          {
            name: "Для мальчиков",
          },
          {
            name: "Для малышей",
          },
        ],
      },
      {
        name: "Мужчинам",
        subcategories: [
          {
            name: "Аксессуары",
          },
          {
            name: "Брюки",
          },
          {
            name: "Верхняя одежда",
          },
          {
            name: "Водолазки",
          },
          {
            name: "Джемперы, свитеры, кардиганы",
          },
        ],
      },
      {
        name: "Аксессуары",
        subcategories: [
          {
            name: "Сумки, рюкзаки, чемоданы",
          },
          {
            name: "Кошельки, визитницы, косметички",
          },
          {
            name: "Ювелирные украшения",
          },
          {
            name: "Бижутерия",
          },
          {
            name: "Часы",
          },
        ],
      },
      {
        name: "Детям",
        subcategories: [
          {
            name: "Аксессуары",
          },
          {
            name: "Для девочек",
          },
          {
            name: "Для мальчиков",
          },
          {
            name: "Для малышей",
          },
          {
            name: "Обувь",
          },
        ],
      },
      {
        name: "Ресейл",
        subcategories: [
          {
            name: "Блузы и рубашки",
          },
          {
            name: "Брюки",
          },
          {
            name: "Джинсы",
          },
          {
            name: "Куртки",
          },
          {
            name: "Очки",
          },
        ],
      },
    ],
  },
  {
    name: "Дом",
    subcategories: [
      {
        name: "Хозяйственные товары",
        subcategories: [
          {
            name: "Хозяйственные сумки",
          },
          {
            name: "Аксессуары для ванной и туалета",
          },
          {
            name: "Инвентарь для уборки",
          },
          {
            name: "Безмены",
          },
        ],
      },
      {
        name: "Антиквариат",
        subcategories: [
          {
            name: "Атрибутика религиозная антикварная и винтажная",
          },
          {
            name: "Банки антикварные и винтажные",
          },
          {
            name: "Бинокли антикварные и винтажные",
          },
          {
            name: "Блюда антикварные и винтажные",
          },
          {
            name: "Бокалы и стаканы антикварные и винтажные",
          },
        ],
      },
      {
        name: "Товары для праздников",
        subcategories: [
          {
            name: "Фейерверки",
          },
          {
            name: "Воздушные шары",
          },
          {
            name: "Подарочная упаковка",
          },
          {
            name: "Украшения для организации праздников",
          },
          {
            name: "Дипломы, медали, значки",
          },
        ],
      },
      {
        name: "Освещение",
        subcategories: [
          {
            name: "Потолочные светильники",
          },
          {
            name: "Настенно-потолочные светильники",
          },
          {
            name: "Настенные светильники",
          },
          {
            name: "Настольные светильники",
          },
          {
            name: "Напольные светильники",
          },
        ],
      },
      {
        name: "Хранение в доме",
        subcategories: [
          {
            name: "Корзины, коробки и органайзеры",
          },
          {
            name: "Вакуумные пакеты",
          },
          {
            name: "Вешалки напольные",
          },
          {
            name: "Вешалки настенные",
          },
          {
            name: "Вешалки-плечики",
          },
        ],
      },
      {
        name: "Интерьер",
        subcategories: [
          {
            name: "Зеркала",
          },
          {
            name: "Шторы, карнизы, декор окна",
          },
          {
            name: "Растения, кашпо, горшки",
          },
          {
            name: "Декор стен",
          },
          {
            name: "Декор интерьера",
          },
        ],
      },
      {
        name: "Умный дом",
        subcategories: [
          {
            name: "Бытовая техника",
          },
          {
            name: "Климат",
          },
          {
            name: "Красота и здоровье",
          },
          {
            name: "Электроника",
          },
          {
            name: "Освещение и электрика",
          },
        ],
      },
      {
        name: "Уход за одеждой и обувью",
        subcategories: [
          {
            name: "Гладильные доски",
          },
          {
            name: "Сушилки для белья",
          },
          {
            name: "Товары для ухода за одеждой и бельем",
          },
          {
            name: "Аксессуары для ухода за обувью",
          },
          {
            name: "Хранение вещей",
          },
        ],
      },
      {
        name: "Текстиль",
        subcategories: [
          {
            name: "Постельное белье",
          },
          {
            name: "Подушки",
          },
          {
            name: "Одеяла",
          },
          {
            name: "Наматрасники и чехлы для матрасов",
          },
          {
            name: "Пледы и покрывала",
          },
        ],
      },
      {
        name: "Мебель",
        subcategories: [
          {
            name: "Мягкая мебель",
          },
          {
            name: "Гардеробы, шкафы и комоды",
          },
          {
            name: "Кухонные столы и стулья",
          },
          {
            name: "Рабочее место",
          },
          {
            name: "Мебель для спальни",
          },
        ],
      },
      {
        name: "Все для Нового года",
        subcategories: [
          {
            name: "Ёлки искусственные",
          },
          {
            name: "Электрогирлянды",
          },
          {
            name: "Уличные гирлянды",
          },
          {
            name: "Ёлочные украшения",
          },
          {
            name: "Символ года",
          },
        ],
      },
    ],
  },
  {
    name: "Детские товары",
    subcategories: [
      {
        name: "Подгузники, гигиена и уход",
        subcategories: [
          {
            name: "Подгузники, салфетки и пеленки",
          },
          {
            name: "Горшки и сиденья",
          },
          {
            name: "Пеленальные столики и доски",
          },
          {
            name: "Принадлежности для купания",
          },
          {
            name: "Косметика и гигиена",
          },
        ],
      },
      {
        name: "Детская комната",
        subcategories: [
          {
            name: "Детская мебель и аксессуары",
          },
          {
            name: "Матрасы и текстиль",
          },
          {
            name: "Защита и безопасность",
          },
        ],
      },
      {
        name: "Книги для детей",
        subcategories: [
          {
            name: "Топ-200 книг для детей",
          },
          {
            name: "Детская художественная литература",
          },
          {
            name: "Познавательная литература",
          },
          {
            name: "Книги для малышей",
          },
          {
            name: "Книги для родителей",
          },
        ],
      },
      {
        name: "Детский спорт",
        subcategories: [
          {
            name: "Детский транспорт",
          },
          {
            name: "Летний спорт",
          },
          {
            name: "Детская площадка",
          },
          {
            name: "Спорт дома",
          },
          {
            name: "Танцы и гимнастика",
          },
        ],
      },
      {
        name: "Питание и кормление",
        subcategories: [
          {
            name: "Детское питание",
          },
          {
            name: "Стульчики для кормления",
          },
          {
            name: "Бутылочки и аксессуары для кормления",
          },
          {
            name: "Молокоотсосы",
          },
          {
            name: "Стерилизаторы",
          },
        ],
      },
      {
        name: "Товары для школы и офиса",
        subcategories: [
          {
            name: "Рюкзаки, ранцы, сумки",
          },
          {
            name: "Тетради, блокноты, дневники",
          },
          {
            name: "Пеналы и письменные принадлежности",
          },
          {
            name: "Чертежные инструменты",
          },
          {
            name: "Канцелярские товары",
          },
        ],
      },
      {
        name: "Товары для мам и малышей",
        subcategories: [
          {
            name: "Питание и кормление",
          },
          {
            name: "Подгузники, гигиена и уход",
          },
          {
            name: "Стульчики для кормления",
          },
          {
            name: "Грудное вскармливание",
          },
          {
            name: "Искусственное вскармливание",
          },
        ],
      },
      {
        name: "Прогулки и путешествия",
        subcategories: [
          {
            name: "Автокресла",
          },
          {
            name: "Коляски",
          },
          {
            name: "Рюкзаки и сумки-кенгуру",
          },
          {
            name: "Слинги и накидки для кормления",
          },
          {
            name: "Конверты и спальные мешки",
          },
        ],
      },
      {
        name: "Хобби и творчество",
        subcategories: [
          {
            name: "Рисование и роспись",
          },
          {
            name: "Шитье и вышивание",
          },
          {
            name: "Пазлы и головоломки",
          },
          {
            name: "Поделки",
          },
          {
            name: "Сборные модели и аксессуары",
          },
        ],
      },
      {
        name: "Развитие и обучение",
        subcategories: [
          {
            name: "ТОП товары для лепки и развития моторики",
          },
          {
            name: "Развивающие пособия и материалы",
          },
          {
            name: "Наборы для опытов и исследований",
          },
          {
            name: "Пазлы",
          },
          {
            name: "Головоломки",
          },
        ],
      },
      {
        name: "Детская одежда и обувь",
        subcategories: [
          {
            name: "Для девочек",
          },
          {
            name: "Для мальчиков",
          },
          {
            name: "Для малышей",
          },
          {
            name: "Обувь",
          },
          {
            name: "Школьная одежда и обувь",
          },
        ],
      },
    ],
  },
  {
    name: "Красота",
    subcategories: [
      {
        name: "Телевизоры и аксессуары",
        subcategories: [
          {
            name: "Телевизоры",
          },
          {
            name: "Кронштейны и стойки",
          },
          {
            name: "Пульты ДУ",
          },
          {
            name: "3D-очки",
          },
          {
            name: "Антенны и запчасти для телевизоров",
          },
        ],
      },
      {
        name: "Наушники и аудиотехника",
        subcategories: [
          {
            name: "Акустические системы",
          },
          {
            name: "Наушники и Bluetooth-гарнитуры",
          },
          {
            name: "Аксессуары для наушников и гарнитур",
          },
          {
            name: "Умные колонки",
          },
          {
            name: "Беспроводные колонки",
          },
        ],
      },
      {
        name: "Фото- и видеокамеры",
        subcategories: [
          {
            name: "Цифровые фотоаппараты",
          },
          {
            name: "Объективы",
          },
          {
            name: "Экшн-камеры",
          },
          {
            name: "Видеокамеры",
          },
          {
            name: "Штативы, держатели и стедикамы",
          },
        ],
      },
      {
        name: "Умный дом",
        subcategories: [
          {
            name: "Умный дом Яндекса с Алисой",
          },
          {
            name: "Бытовая техника",
          },
          {
            name: "Климат",
          },
          {
            name: "Красота и здоровье",
          },
          {
            name: "Электроника",
          },
        ],
      },
      {
        name: "Робототехника и 3D-конструирование",
        subcategories: [
          {
            name: "Квадрокоптеры",
          },
          {
            name: "3D-принтеры",
          },
          {
            name: "Расходные материалы и аксессуары для 3D-принтеров",
          },
          {
            name: "3D-ручки",
          },
          {
            name: "Робототехника и конструкторы",
          },
        ],
      },
      {
        name: "Ноутбуки, планшеты и электронные книги",
        subcategories: [
          {
            name: "Ноутбуки",
          },
          {
            name: "Аксессуары для ноутбуков",
          },
          {
            name: "Гейминг",
          },
          {
            name: "Планшеты",
          },
          {
            name: "Аксессуары для планшетов",
          },
        ],
      },
      {
        name: "Умные колонки",
        subcategories: [
          {
            name: "Умные колонки Яндекс",
          },
          {
            name: "Умные колонки JBL",
          },
          {
            name: "Умные колонки Apple",
          },
          {
            name: "Умные колонки VK",
          },
          {
            name: "Умные колонки RAINBO",
          },
        ],
      },
      {
        name: "Гейминг",
        subcategories: [
          {
            name: "Все игровые приставки",
          },
          {
            name: "Ретроконсоли",
          },
          {
            name: "Игровые ноутбуки",
          },
          {
            name: "Игровые компьютеры",
          },
          {
            name: "Игры",
          },
        ],
      },
      {
        name: "Оргтехника и расходные материалы",
        subcategories: [
          {
            name: "Принтеры и МФУ",
          },
          {
            name: "Сканеры",
          },
          {
            name: "Уничтожители бумаг (шредеры)",
          },
          {
            name: "Режущие плоттеры",
          },
          {
            name: "Брошюровщики",
          },
        ],
      },
      {
        name: "Электронные музыкальные инструменты",
        subcategories: [
          {
            name: "Синтезаторы и MIDI-клавиатуры",
          },
          {
            name: "Аксессуары для клавишных",
          },
          {
            name: "Электрогитары и бас-гитары",
          },
          {
            name: "Электронные скрипки и контрабасы",
          },
          {
            name: "Электронные ударные установки",
          },
        ],
      },
      {
        name: "Услуги установки",
        subcategories: [],
      },
      {
        name: "Компьютеры и комплектующие",
        subcategories: [
          {
            name: "Мониторы",
          },
          {
            name: "Моноблоки",
          },
          {
            name: "Системные блоки",
          },
          {
            name: "Гейминг",
          },
          {
            name: "Комплектующие для компьютера",
          },
        ],
      },
      {
        name: "Цифровые товары",
        subcategories: [
          {
            name: "Цифровые и подарочные сертификаты",
          },
          {
            name: "Онлайн-подписки",
          },
          {
            name: "Карты пополнения счета",
          },
          {
            name: "Игры для приставок и ПК",
          },
          {
            name: "Программы",
          },
        ],
      },
      {
        name: "Видеотехника",
        subcategories: [
          {
            name: "Мультимедиа-проекторы",
          },
          {
            name: "Экраны",
          },
          {
            name: "Интерактивные доски и аксессуары",
          },
          {
            name: "Оверхед и слайд-проекторы",
          },
          {
            name: "Аксессуары и запчасти для проекторов",
          },
        ],
      },
      {
        name: "Сетевое оборудование и связь",
        subcategories: [
          {
            name: "Беспроводное оборудование",
          },
          {
            name: "Проводные маршрутизаторы и коммутаторы",
          },
          {
            name: "Сетевые хранилища (NAS)",
          },
          {
            name: "3G/4G LTE и ADSL модемы",
          },
          {
            name: "Оборудование для конференций",
          },
        ],
      },
      {
        name: "Автомобильная электроника",
        subcategories: [
          {
            name: "Видеорегистраторы",
          },
          {
            name: "Автомагнитолы",
          },
          {
            name: "Автоакустика",
          },
          {
            name: "Усилители",
          },
          {
            name: "Автомобильные телевизоры",
          },
        ],
      },
      {
        name: "Аксессуары для электроники",
        subcategories: [
          {
            name: "Кабели, разъемы, переходники",
          },
          {
            name: "Удлинители и сетевые фильтры",
          },
          {
            name: "USB-концентраторы",
          },
          {
            name: "Держатели для проводов",
          },
          {
            name: "Батарейки и аккумуляторы",
          },
        ],
      },
    ],
  },
  {
    name: "Электроника",
    subcategories: [
      {
        name: "Рабочее место",
        subcategories: [
          {
            name: "Рабочие столы",
          },
          {
            name: "Рабочие кресла",
          },
          {
            name: "Офисные тумбы и комоды",
          },
          {
            name: "Шкафы для документов",
          },
          {
            name: "Стеллажи и этажерки",
          },
        ],
      },
      {
        name: "Мебель для геймеров",
        subcategories: [
          {
            name: "Столы для геймеров",
          },
          {
            name: "Стулья для геймеров",
          },
        ],
      },
      {
        name: "Мебель для гостиной",
        subcategories: [
          {
            name: "Мягкая мебель",
          },
          {
            name: "Журнальные столики",
          },
          {
            name: "Стеллажи и этажерки",
          },
          {
            name: "Шкафы витрины",
          },
          {
            name: "Стенки для гостиной",
          },
        ],
      },
      {
        name: "Садовая и уличная мебель",
        subcategories: [
          {
            name: "Столы для сада и улицы",
          },
          {
            name: "Стулья и кресла для сада и улицы",
          },
          {
            name: "Подвесные кресла",
          },
          {
            name: "Скамейки и диваны",
          },
          {
            name: "Гамаки",
          },
        ],
      },
      {
        name: "Столы и стулья",
        subcategories: [
          {
            name: "Компьютерные кресла",
          },
          {
            name: "Столы компьютерные и письменные",
          },
          {
            name: "Столы и столики",
          },
          {
            name: "Стулья, табуретки",
          },
          {
            name: "Банкетки, пуфики, скамьи",
          },
        ],
      },
      {
        name: "Гардеробы, шкафы и комоды",
        subcategories: [
          {
            name: "Гардеробные системы",
          },
          {
            name: "Шкафы для одежды",
          },
          {
            name: "Тумбы и комоды",
          },
        ],
      },
      {
        name: "Мебель для спальни",
        subcategories: [
          {
            name: "Кровати",
          },
          {
            name: "Матрасы",
          },
          {
            name: "Прикроватные тумбы",
          },
          {
            name: "Кушетки",
          },
          {
            name: "Раскладушки",
          },
        ],
      },
      {
        name: "Мебель для прихожей",
        subcategories: [
          {
            name: "Обувницы",
          },
          {
            name: "Вешалки (рейлы)",
          },
          {
            name: "Пуфики, банкетки и скамьи",
          },
          {
            name: "Шкафы",
          },
          {
            name: "Комплекты для прихожей",
          },
        ],
      },
      {
        name: "Детская мебель",
        subcategories: [
          {
            name: "Кровати",
          },
          {
            name: "Матрасы",
          },
          {
            name: "Шкафы для детской",
          },
          {
            name: "Комоды",
          },
          {
            name: "Стеллажи для детской",
          },
        ],
      },
      {
        name: "Надувная мебель",
        subcategories: [
          {
            name: "Надувные диваны",
          },
          {
            name: "Надувные кресла",
          },
          {
            name: "Надувные матрасы",
          },
          {
            name: "Диваны надувные",
          },
          {
            name: "Комплекты надувной мебели",
          },
        ],
      },
      {
        name: "Шкафы",
        subcategories: [
          {
            name: "Шкафы для одежды",
          },
          {
            name: "Шкафы для гостиной",
          },
          {
            name: "Шкафы для ванных",
          },
          {
            name: "Шкафы кухонные навесные",
          },
          {
            name: "Антресоли мебельные",
          },
        ],
      },
      {
        name: "Кухонные столы и стулья",
        subcategories: [
          {
            name: "Кухонные столы",
          },
          {
            name: "Кухонные стулья и табуретки",
          },
          {
            name: "Обеденные группы",
          },
          {
            name: "Кухонные уголки и диваны",
          },
          {
            name: "Барные столы",
          },
        ],
      },
      {
        name: "Мебель для кухни",
        subcategories: [
          {
            name: "Кухонные гарнитуры",
          },
          {
            name: "Модули кухонные напольные",
          },
          {
            name: "Шкафы витрины",
          },
          {
            name: "Столешницы кухонные",
          },
          {
            name: "Кухонные фартуки на стену",
          },
        ],
      },
      {
        name: "Мебель для ванной",
        subcategories: [
          {
            name: "Тумбы для ванной",
          },
          {
            name: "Шкафы для ванных комнат",
          },
          {
            name: "Мебель для ванных комнат",
          },
          {
            name: "Тележки и этажерки на колесах",
          },
          {
            name: "Полки, этажерки",
          },
        ],
      },
      {
        name: "Готовые комплекты",
        subcategories: [
          {
            name: "Спальни",
          },
          {
            name: "Кухонные гарнитуры",
          },
          {
            name: "Гостиные",
          },
          {
            name: "Прихожие",
          },
          {
            name: "Мебель для ванных комнат",
          },
        ],
      },
      {
        name: "Фурнитура для мебели и комплектующие",
        subcategories: [
          {
            name: "Фурнитура для мебели",
          },
          {
            name: "Комплектующие",
          },
          {
            name: "Насосы и аксессуары",
          },
        ],
      },
      {
        name: "Услуги установки мебели",
        subcategories: [],
      },
    ],
  },
  {
    name: "Бытовая техника",
    subcategories: [
      {
        name: "Уход за телом",
        subcategories: [
          {
            name: "Для душа",
          },
          {
            name: "Мыло",
          },
          {
            name: "Кремы и масла",
          },
          {
            name: "Дезодоранты для женщин",
          },
          {
            name: "Дезодоранты для мужчин",
          },
        ],
      },
      {
        name: "Защита от солнца",
        subcategories: [
          {
            name: "Детские солнцезащитные средства",
          },
          {
            name: "Защита от солнца для лица",
          },
          {
            name: "Защита от солнца для тела",
          },
          {
            name: "Средства для загара",
          },
          {
            name: "Автозагар",
          },
        ],
      },
      {
        name: "Мужчинам",
        subcategories: [
          {
            name: "Электробритвы",
          },
          {
            name: "Бритвы и лезвия",
          },
          {
            name: "Средства для бритья",
          },
          {
            name: "Уход для бороды и усов",
          },
          {
            name: "Аксессуары для бороды и усов",
          },
        ],
      },
      {
        name: "Профессиональная косметика",
        subcategories: [
          {
            name: "Уход за волосами",
          },
          {
            name: "Уход за лицом",
          },
          {
            name: "Уход за телом",
          },
          {
            name: "Макияж",
          },
          {
            name: "Мужчинам",
          },
        ],
      },
      {
        name: "Натуральная косметика",
        subcategories: [
          {
            name: "Уход за волосами",
          },
          {
            name: "Уход за лицом",
          },
          {
            name: "Уход за телом",
          },
          {
            name: "Детям и мамам",
          },
          {
            name: "Макияж",
          },
        ],
      },
      {
        name: "Уход за волосами",
        subcategories: [
          {
            name: "Шампуни",
          },
          {
            name: "Маски и сыворотки",
          },
          {
            name: "Бальзамы и ополаскиватели",
          },
          {
            name: "Сухие и твердые шампуни",
          },
          {
            name: "Наборы",
          },
        ],
      },
      {
        name: "Макияж",
        subcategories: [
          {
            name: "Снятие макияжа",
          },
          {
            name: "Для лица",
          },
          {
            name: "Для глаз",
          },
          {
            name: "Для бровей",
          },
          {
            name: "Для губ",
          },
        ],
      },
      {
        name: "Косметические наборы",
        subcategories: [
          {
            name: "Мужские",
          },
          {
            name: "Парфюмерные",
          },
          {
            name: "Для волос",
          },
          {
            name: "Для лица",
          },
          {
            name: "Для тела",
          },
        ],
      },
      {
        name: "Уход за ногтями",
        subcategories: [
          {
            name: "Принадлежности для маникюра и педикюра",
          },
          {
            name: "Уход и лечение",
          },
          {
            name: "Уход за руками",
          },
          {
            name: "Уход за ногами",
          },
          {
            name: "Окрашивание ногтей",
          },
        ],
      },
      {
        name: "Азиатская косметика",
        subcategories: [
          {
            name: "Уход за волосами",
          },
          {
            name: "Уход за лицом",
          },
          {
            name: "Уход за телом",
          },
          {
            name: "Макияж",
          },
          {
            name: "Мужчинам",
          },
        ],
      },
      {
        name: "Детская косметика и духи",
        subcategories: [],
      },
      {
        name: "Уход за лицом",
        subcategories: [
          {
            name: "Кремы и сыворотки",
          },
          {
            name: "Уход за кожей вокруг глаз",
          },
          {
            name: "Средства для умывания",
          },
          {
            name: "Наборы",
          },
          {
            name: "Маски",
          },
        ],
      },
      {
        name: "Парфюмерия",
        subcategories: [
          {
            name: "Женская",
          },
          {
            name: "Мужская",
          },
          {
            name: "Унисекс",
          },
          {
            name: "Нишевая",
          },
          {
            name: "Люксовая",
          },
        ],
      },
      {
        name: "Премиальная косметика",
        subcategories: [
          {
            name: "Уход за лицом",
          },
          {
            name: "Уход за телом",
          },
          {
            name: "Макияж",
          },
          {
            name: "Уход за волосами",
          },
          {
            name: "Парфюмерия",
          },
        ],
      },
      {
        name: "Инструменты и аксессуары",
        subcategories: [
          {
            name: "Зеркала косметические",
          },
          {
            name: "Кисти, спонжи для макияжа",
          },
          {
            name: "Роллеры для лица",
          },
          {
            name: "Роллеры для тела",
          },
          {
            name: "Лампы-лупы",
          },
        ],
      },
      {
        name: "Ароматерапия",
        subcategories: [
          {
            name: "Эфирные масла",
          },
          {
            name: "Аксессуары",
          },
          {
            name: "Благовония",
          },
          {
            name: "Аромалампы",
          },
        ],
      },
    ],
  },
  {
    name: "Цветы",
    subcategories: [
      {
        name: "Выбор флориста",
        subcategories: [],
      },
      {
        name: "Монобукеты",
        subcategories: [
          {
            name: "Букеты из роз",
          },
          {
            name: "Букеты из хризантем",
          },
          {
            name: "Букеты из орхидей",
          },
          {
            name: "Букеты из пионов",
          },
        ],
      },
      {
        name: "Выгодно",
        subcategories: [],
      },
      {
        name: "Эксклюзивно на Маркете",
        subcategories: [],
      },
      {
        name: "Премиальные букеты",
        subcategories: [
          {
            name: "Монобукеты",
          },
          {
            name: "Сборные букеты",
          },
        ],
      },
      {
        name: "Сезон пионов",
        subcategories: [],
      },
      {
        name: "Авторские букеты",
        subcategories: [],
      },
    ],
  },
  {
    name: "Дача и сад",
    subcategories: [
      {
        name: "Уход за растениями",
        subcategories: [
          {
            name: "Удобрения",
          },
          {
            name: "Средства для защиты растений",
          },
          {
            name: "Выращивание рассады",
          },
          {
            name: "Фитолампы",
          },
          {
            name: "Субстраты, грунты, мульча",
          },
        ],
      },
      {
        name: "Души, умывальники, туалеты",
        subcategories: [
          {
            name: "Биотуалеты",
          },
          {
            name: "Души",
          },
          {
            name: "Умывальники",
          },
          {
            name: "Жидкости и наполнители для биотуалетов",
          },
          {
            name: "Аксессуары и комплектующие",
          },
        ],
      },
      {
        name: "Аксессуары для полива",
        subcategories: [
          {
            name: "Шланги и комплекты для полива",
          },
          {
            name: "Капельный полив",
          },
          {
            name: "Системы управления поливом",
          },
          {
            name: "Пистолеты, насадки, дождеватели",
          },
          {
            name: "Катушки, кронштейны и направляющие",
          },
        ],
      },
      {
        name: "Садовые инструменты",
        subcategories: [
          {
            name: "Снегоуборочные лопаты",
          },
          {
            name: "Ледорубы и скребки",
          },
          {
            name: "Топоры",
          },
          {
            name: "Канистры",
          },
          {
            name: "Секаторы, высоторезы, сучкорезы",
          },
        ],
      },
      {
        name: "Газоны, саженцы, семена",
        subcategories: [
          {
            name: "Газоны",
          },
          {
            name: "Луковичные растения",
          },
          {
            name: "Лук севок, семенной картофель, чеснок",
          },
          {
            name: "Рассада, саженцы, кустарники, деревья",
          },
          {
            name: "Семена овощей, ягод и цветов",
          },
        ],
      },
      {
        name: "Бассейны и аксессуары",
        subcategories: [
          {
            name: "Бассейны",
          },
          {
            name: "Фильтры, насосы и хлоргенераторы",
          },
          {
            name: "Пылесосы",
          },
          {
            name: "Аксессуары",
          },
          {
            name: "Химические средства",
          },
        ],
      },
      {
        name: "Фонтаны и садовый декор",
        subcategories: [
          {
            name: "Садовый декор",
          },
          {
            name: "Фонтаны и пруды",
          },
        ],
      },
      {
        name: "Сауны и бани",
        subcategories: [
          {
            name: "Сауны",
          },
          {
            name: "Печи для бани",
          },
          {
            name: "Парогенераторы",
          },
          {
            name: "Аксессуары",
          },
          {
            name: "Бочки и купели",
          },
        ],
      },
      {
        name: "Пикник, барбекю, гриль",
        subcategories: [
          {
            name: "Грили, барбекю, коптильни",
          },
          {
            name: "Мангалы",
          },
          {
            name: "Средства для розжига",
          },
          {
            name: "Аксессуары для грилей и мангалов",
          },
          {
            name: "Шампуры",
          },
        ],
      },
      {
        name: "Садовая мебель",
        subcategories: [
          {
            name: "Качели и аксессуары",
          },
          {
            name: "Подвесные кресла",
          },
          {
            name: "Лежаки и шезлонги",
          },
          {
            name: "Шатры",
          },
          {
            name: "Зонты от солнца",
          },
        ],
      },
      {
        name: "Парники и теплицы",
        subcategories: [
          {
            name: "Теплицы и каркасы",
          },
          {
            name: "Парники и дуги",
          },
        ],
      },
    ],
  },
  {
    name: "Продукты питания",
    subcategories: [
      {
        name: "Вода, соки, напитки",
        subcategories: [
          {
            name: "Вода",
          },
          {
            name: "Соки и нектары",
          },
          {
            name: "Лимонады и газированные напитки",
          },
          {
            name: "Растительные напитки",
          },
          {
            name: "Холодный чай",
          },
        ],
      },
      {
        name: "Макароны, крупы",
        subcategories: [
          {
            name: "Макароны",
          },
          {
            name: "Этнические макаронные изделия",
          },
          {
            name: "Геркулес и хлопья",
          },
          {
            name: "Готовые завтраки, мюсли, гранола",
          },
          {
            name: "Рис",
          },
        ],
      },
      {
        name: "Консервация",
        subcategories: [
          {
            name: "Мясная",
          },
          {
            name: "Рыбная",
          },
          {
            name: "Овощная",
          },
          {
            name: "Блюда готовые",
          },
          {
            name: "Маслины, оливки, каперсы",
          },
        ],
      },
      {
        name: "Все для выпечки",
        subcategories: [
          {
            name: "Мука и смеси для выпечки",
          },
          {
            name: "Сахарозаменители",
          },
          {
            name: "Сахар",
          },
          {
            name: "Дрожжи",
          },
          {
            name: "Сухое молоко, сливки",
          },
        ],
      },
      {
        name: "Здоровое питание",
        subcategories: [
          {
            name: "Без глютена",
          },
          {
            name: "Без лактозы",
          },
          {
            name: "Без сахара",
          },
          {
            name: "Полезные жиры",
          },
          {
            name: "Полезный перекус",
          },
        ],
      },
      {
        name: "Мясная гастрономия",
        subcategories: [
          {
            name: "Мясо",
          },
          {
            name: "Птица",
          },
          {
            name: "Субпродукты мясные",
          },
          {
            name: "Полуфабрикаты из мяса",
          },
          {
            name: "Субпродукты из птицы",
          },
        ],
      },
      {
        name: "Фрукты, овощи и грибы",
        subcategories: [
          {
            name: "Грибы",
          },
          {
            name: "Овощи",
          },
          {
            name: "Фрукты",
          },
          {
            name: "Ягоды",
          },
          {
            name: "Зелень, салаты",
          },
        ],
      },
      {
        name: "Подарочные сертификаты",
        subcategories: [],
      },
      {
        name: "Кондитерские изделия",
        subcategories: [
          {
            name: "Конфеты",
          },
          {
            name: "Шоколадная плитка",
          },
          {
            name: "Шоколадная и ореховая паста",
          },
          {
            name: "Шоколадные яйца и фигурный шоколад",
          },
          {
            name: "Шоколадные батончики",
          },
        ],
      },
      {
        name: "Снеки",
        subcategories: [
          {
            name: "Батончики мюсли",
          },
          {
            name: "Чипсы",
          },
          {
            name: "Сухарики",
          },
          {
            name: "Снеки, закуски",
          },
          {
            name: "Попкорн",
          },
        ],
      },
      {
        name: "Соусы, кетчупы",
        subcategories: [
          {
            name: "Соусы",
          },
          {
            name: "Кетчуп",
          },
          {
            name: "Томатная паста",
          },
          {
            name: "Уксус",
          },
          {
            name: "Аджика, маринады",
          },
        ],
      },
      {
        name: "Приправы и специи",
        subcategories: [
          {
            name: "Специи",
          },
          {
            name: "Приправы",
          },
          {
            name: "Подарочные наборы с пряностями и специями",
          },
          {
            name: "Соль",
          },
        ],
      },
      {
        name: "Десертные соусы, варенье, мед",
        subcategories: [
          {
            name: "Десертные соусы и топпинги",
          },
          {
            name: "Варенье, повидло, протертые ягоды",
          },
          {
            name: "Мед и продукты пчеловодства",
          },
          {
            name: "Фрукты и ягоды консервированные",
          },
          {
            name: "Сгущенное молоко",
          },
        ],
      },
      {
        name: "Хлеб и хлебобулочные изделия",
        subcategories: [
          {
            name: "Хлеб, лаваши",
          },
          {
            name: "Выпечка и сдоба",
          },
          {
            name: "Хлебцы",
          },
        ],
      },
      {
        name: "Рыбная гастрономия",
        subcategories: [
          {
            name: "Икра",
          },
          {
            name: "Рыба соленая, копченая",
          },
          {
            name: "Пресервы",
          },
          {
            name: "Крабовое мясо и палочки",
          },
          {
            name: "Морепродукты свежие",
          },
        ],
      },
      {
        name: "Кулинария",
        subcategories: [
          {
            name: "Завтраки",
          },
          {
            name: "Оладьи, блинчики, пирожки",
          },
          {
            name: "Холодные блюда и закуски",
          },
          {
            name: "Соленые овощи и грибы",
          },
          {
            name: "Салаты",
          },
        ],
      },
      {
        name: "Алкоголь",
        subcategories: [
          {
            name: "Безалкогольное пиво и вино",
          },
          {
            name: "Вино",
          },
          {
            name: "Шампанское и игристое вино",
          },
          {
            name: "Крепленое вино",
          },
          {
            name: "Коньяк и бренди",
          },
        ],
      },
      {
        name: "Орехи, семена, сухофрукты",
        subcategories: [
          {
            name: "Орехи",
          },
          {
            name: "Смеси из орехов и сухофруктов",
          },
          {
            name: "Сухофрукты",
          },
          {
            name: "Семечки и семена",
          },
          {
            name: "Суперфуды",
          },
        ],
      },
      {
        name: "Масло растительное",
        subcategories: [
          {
            name: "Подсолнечное",
          },
          {
            name: "Оливковое",
          },
          {
            name: "Кокосовое",
          },
          {
            name: "Льняное",
          },
          {
            name: "Кунжутное",
          },
        ],
      },
      {
        name: "Блюда быстрого приготовления",
        subcategories: [
          {
            name: "Каши",
          },
          {
            name: "Пюре и лапша",
          },
          {
            name: "Супы, бульоны",
          },
        ],
      },
      {
        name: "Этническая кухня",
        subcategories: [
          {
            name: "Наборы и ингредиенты",
          },
          {
            name: "Этнические макаронные изделия",
          },
        ],
      },
      {
        name: "Молоко, сыр, яйца",
        subcategories: [
          {
            name: "Молоко",
          },
          {
            name: "Сливки",
          },
          {
            name: "Растительные продукты",
          },
          {
            name: "Кисломолочная продукция",
          },
          {
            name: "Творог",
          },
        ],
      },
      {
        name: "Замороженные продукты",
        subcategories: [
          {
            name: "Рыба и морепродукты",
          },
          {
            name: "Блюда и полуфабрикаты",
          },
          {
            name: "Мясо и птица",
          },
          {
            name: "Овощи, фрукты, грибы",
          },
          {
            name: "Мороженое",
          },
        ],
      },
      {
        name: "Подарочные наборы",
        subcategories: [],
      },
    ],
  },
  {
    name: "Строительство и ремонт",
    subcategories: [
      {
        name: "Водоснабжение",
        subcategories: [
          {
            name: "Насосы и комплектующие",
          },
          {
            name: "Фильтры для воды и комплектующие",
          },
          {
            name: "Септики",
          },
          {
            name: "Сифоны и трапы",
          },
          {
            name: "Расширительные баки и комплектующие",
          },
        ],
      },
      {
        name: "Электрика",
        subcategories: [
          {
            name: "Провода, кабели",
          },
          {
            name: "Автоматы, УЗО, дифавтоматы",
          },
          {
            name: "Изделия для электромонтажа",
          },
          {
            name: "Системы безопасности",
          },
          {
            name: "Устройства электропитания и электростанции",
          },
        ],
      },
      {
        name: "Двери, окна, лестницы и аксессуары",
        subcategories: [
          {
            name: "Входные двери",
          },
          {
            name: "Межкомнатные двери и коробки",
          },
          {
            name: "Окна, балконные двери, подоконники",
          },
          {
            name: "Ручки, замки и фурнитура для окон и дверей",
          },
          {
            name: "Домофоны, звонки и системы безопасности",
          },
        ],
      },
      {
        name: "Силовая техника",
        subcategories: [
          {
            name: "Генераторы",
          },
          {
            name: "Сварочное оборудование",
          },
          {
            name: "Воздушные компрессоры",
          },
          {
            name: "Пневмоинструмент",
          },
          {
            name: "Грузоподъемная техника",
          },
        ],
      },
      {
        name: "Отопление",
        subcategories: [
          {
            name: "Отопительные котлы и комплектующие для котлов",
          },
          {
            name: "Обогреватели",
          },
          {
            name: "Тепловые пушки",
          },
          {
            name: "Полотенцесушители и аксессуары",
          },
          {
            name: "Радиаторы и комплектующие",
          },
        ],
      },
      {
        name: "Строительные материалы",
        subcategories: [
          {
            name: "Лакокрасочные материалы",
          },
          {
            name: "Изоляционные материалы",
          },
          {
            name: "Строительные смеси",
          },
          {
            name: "Листовые материалы",
          },
          {
            name: "Кирпич и общестроительные материалы",
          },
        ],
      },
      {
        name: "Крепеж и фурнитура",
        subcategories: [
          {
            name: "Крепеж",
          },
          {
            name: "Ручки, замки для окон и дверей",
          },
          {
            name: "Фурнитура для мебели",
          },
          {
            name: "Такелаж",
          },
        ],
      },
      {
        name: "Сантехника",
        subcategories: [
          {
            name: "Смесители",
          },
          {
            name: "Ванны",
          },
          {
            name: "Раковины, пьедесталы",
          },
          {
            name: "Кухонные мойки",
          },
          {
            name: "Унитазы, писсуары, биде, инсталляции",
          },
        ],
      },
      {
        name: "Вентиляция",
        subcategories: [
          {
            name: "Вентиляционные установки",
          },
          {
            name: "Вентиляторы вытяжные",
          },
          {
            name: "Канальные вентиляторы",
          },
          {
            name: "Вентиляционные решетки, диффузоры и анемостаты",
          },
          {
            name: "Канальные нагреватели и охладители",
          },
        ],
      },
      {
        name: "Отделочные материалы",
        subcategories: [
          {
            name: "Керамическая плитка и керамогранит",
          },
          {
            name: "Лакокрасочные материалы",
          },
          {
            name: "Обои",
          },
          {
            name: "Напольные покрытия",
          },
          {
            name: "Декоративные настенные покрытия",
          },
        ],
      },
      {
        name: "Строительная техника",
        subcategories: [],
      },
    ],
  },
  {
    name: "Мебель",
    subcategories: [
      {
        name: "Рабочее место",
        subcategories: [
          {
            name: "Рабочие столы",
          },
          {
            name: "Рабочие кресла",
          },
          {
            name: "Офисные тумбы и комоды",
          },
          {
            name: "Шкафы для документов",
          },
          {
            name: "Стеллажи и этажерки",
          },
        ],
      },
      {
        name: "Мебель для геймеров",
        subcategories: [
          {
            name: "Столы для геймеров",
          },
          {
            name: "Стулья для геймеров",
          },
        ],
      },
      {
        name: "Мебель для гостиной",
        subcategories: [
          {
            name: "Мягкая мебель",
          },
          {
            name: "Журнальные столики",
          },
          {
            name: "Стеллажи и этажерки",
          },
          {
            name: "Шкафы витрины",
          },
          {
            name: "Стенки для гостиной",
          },
        ],
      },
      {
        name: "Садовая и уличная мебель",
        subcategories: [
          {
            name: "Столы для сада и улицы",
          },
          {
            name: "Стулья и кресла для сада и улицы",
          },
          {
            name: "Подвесные кресла",
          },
          {
            name: "Скамейки и диваны",
          },
          {
            name: "Гамаки",
          },
        ],
      },
      {
        name: "Столы и стулья",
        subcategories: [
          {
            name: "Компьютерные кресла",
          },
          {
            name: "Столы компьютерные и письменные",
          },
          {
            name: "Столы и столики",
          },
          {
            name: "Стулья, табуретки",
          },
          {
            name: "Банкетки, пуфики, скамьи",
          },
        ],
      },
      {
        name: "Гардеробы, шкафы и комоды",
        subcategories: [
          {
            name: "Гардеробные системы",
          },
          {
            name: "Шкафы для одежды",
          },
          {
            name: "Тумбы и комоды",
          },
        ],
      },
      {
        name: "Мебель для спальни",
        subcategories: [
          {
            name: "Кровати",
          },
          {
            name: "Матрасы",
          },
          {
            name: "Прикроватные тумбы",
          },
          {
            name: "Кушетки",
          },
          {
            name: "Раскладушки",
          },
        ],
      },
      {
        name: "Мебель для прихожей",
        subcategories: [
          {
            name: "Обувницы",
          },
          {
            name: "Вешалки (рейлы)",
          },
          {
            name: "Пуфики, банкетки и скамьи",
          },
          {
            name: "Шкафы",
          },
          {
            name: "Комплекты для прихожей",
          },
        ],
      },
      {
        name: "Детская мебель",
        subcategories: [
          {
            name: "Кровати",
          },
          {
            name: "Матрасы",
          },
          {
            name: "Шкафы для детской",
          },
          {
            name: "Комоды",
          },
          {
            name: "Стеллажи для детской",
          },
        ],
      },
      {
        name: "Надувная мебель",
        subcategories: [
          {
            name: "Надувные диваны",
          },
          {
            name: "Надувные кресла",
          },
          {
            name: "Надувные матрасы",
          },
          {
            name: "Диваны надувные",
          },
          {
            name: "Комплекты надувной мебели",
          },
        ],
      },
      {
        name: "Шкафы",
        subcategories: [
          {
            name: "Шкафы для одежды",
          },
          {
            name: "Шкафы для гостиной",
          },
          {
            name: "Шкафы для ванных",
          },
          {
            name: "Шкафы кухонные навесные",
          },
          {
            name: "Антресоли мебельные",
          },
        ],
      },
      {
        name: "Кухонные столы и стулья",
        subcategories: [
          {
            name: "Кухонные столы",
          },
          {
            name: "Кухонные стулья и табуретки",
          },
          {
            name: "Обеденные группы",
          },
          {
            name: "Кухонные уголки и диваны",
          },
          {
            name: "Барные столы",
          },
        ],
      },
      {
        name: "Мебель для кухни",
        subcategories: [
          {
            name: "Кухонные гарнитуры",
          },
          {
            name: "Модули кухонные напольные",
          },
          {
            name: "Шкафы витрины",
          },
          {
            name: "Столешницы кухонные",
          },
          {
            name: "Кухонные фартуки на стену",
          },
        ],
      },
      {
        name: "Мебель для ванной",
        subcategories: [
          {
            name: "Тумбы для ванной",
          },
          {
            name: "Шкафы для ванных комнат",
          },
          {
            name: "Мебель для ванных комнат",
          },
          {
            name: "Тележки и этажерки на колесах",
          },
          {
            name: "Полки, этажерки",
          },
        ],
      },
      {
        name: "Готовые комплекты",
        subcategories: [
          {
            name: "Спальни",
          },
          {
            name: "Кухонные гарнитуры",
          },
          {
            name: "Гостиные",
          },
          {
            name: "Прихожие",
          },
          {
            name: "Мебель для ванных комнат",
          },
        ],
      },
      {
        name: "Фурнитура для мебели и комплектующие",
        subcategories: [
          {
            name: "Фурнитура для мебели",
          },
          {
            name: "Комплектующие",
          },
          {
            name: "Насосы и аксессуары",
          },
        ],
      },
      {
        name: "Услуги установки мебели",
        subcategories: [],
      },
    ],
  },
  {
    name: "Скидки и акции",
    subcategories: [
      {
        name: "Вода, соки, напитки",
        subcategories: [
          {
            name: "Вода",
          },
          {
            name: "Соки и нектары",
          },
          {
            name: "Лимонады и газированные напитки",
          },
          {
            name: "Растительные напитки",
          },
          {
            name: "Холодный чай",
          },
        ],
      },
      {
        name: "Макароны, крупы",
        subcategories: [
          {
            name: "Макароны",
          },
          {
            name: "Этнические макаронные изделия",
          },
          {
            name: "Геркулес и хлопья",
          },
          {
            name: "Готовые завтраки, мюсли, гранола",
          },
          {
            name: "Рис",
          },
        ],
      },
      {
        name: "Консервация",
        subcategories: [
          {
            name: "Мясная",
          },
          {
            name: "Рыбная",
          },
          {
            name: "Овощная",
          },
          {
            name: "Блюда готовые",
          },
          {
            name: "Маслины, оливки, каперсы",
          },
        ],
      },
      {
        name: "Все для выпечки",
        subcategories: [
          {
            name: "Мука и смеси для выпечки",
          },
          {
            name: "Сахарозаменители",
          },
          {
            name: "Сахар",
          },
          {
            name: "Дрожжи",
          },
          {
            name: "Сухое молоко, сливки",
          },
        ],
      },
      {
        name: "Здоровое питание",
        subcategories: [
          {
            name: "Без глютена",
          },
          {
            name: "Без лактозы",
          },
          {
            name: "Без сахара",
          },
          {
            name: "Полезные жиры",
          },
          {
            name: "Полезный перекус",
          },
        ],
      },
      {
        name: "Мясная гастрономия",
        subcategories: [
          {
            name: "Мясо",
          },
          {
            name: "Птица",
          },
          {
            name: "Субпродукты мясные",
          },
          {
            name: "Полуфабрикаты из мяса",
          },
          {
            name: "Субпродукты из птицы",
          },
        ],
      },
      {
        name: "Фрукты, овощи и грибы",
        subcategories: [
          {
            name: "Грибы",
          },
          {
            name: "Овощи",
          },
          {
            name: "Фрукты",
          },
          {
            name: "Ягоды",
          },
          {
            name: "Зелень, салаты",
          },
        ],
      },
      {
        name: "Подарочные сертификаты",
        subcategories: [],
      },
      {
        name: "Кондитерские изделия",
        subcategories: [
          {
            name: "Конфеты",
          },
          {
            name: "Шоколадная плитка",
          },
          {
            name: "Шоколадная и ореховая паста",
          },
          {
            name: "Шоколадные яйца и фигурный шоколад",
          },
          {
            name: "Шоколадные батончики",
          },
        ],
      },
      {
        name: "Снеки",
        subcategories: [
          {
            name: "Батончики мюсли",
          },
          {
            name: "Чипсы",
          },
          {
            name: "Сухарики",
          },
          {
            name: "Снеки, закуски",
          },
          {
            name: "Попкорн",
          },
        ],
      },
      {
        name: "Соусы, кетчупы",
        subcategories: [
          {
            name: "Соусы",
          },
          {
            name: "Кетчуп",
          },
          {
            name: "Томатная паста",
          },
          {
            name: "Уксус",
          },
          {
            name: "Аджика, маринады",
          },
        ],
      },
      {
        name: "Приправы и специи",
        subcategories: [
          {
            name: "Специи",
          },
          {
            name: "Приправы",
          },
          {
            name: "Подарочные наборы с пряностями и специями",
          },
          {
            name: "Соль",
          },
        ],
      },
      {
        name: "Десертные соусы, варенье, мед",
        subcategories: [
          {
            name: "Десертные соусы и топпинги",
          },
          {
            name: "Варенье, повидло, протертые ягоды",
          },
          {
            name: "Мед и продукты пчеловодства",
          },
          {
            name: "Фрукты и ягоды консервированные",
          },
          {
            name: "Сгущенное молоко",
          },
        ],
      },
      {
        name: "Хлеб и хлебобулочные изделия",
        subcategories: [
          {
            name: "Хлеб, лаваши",
          },
          {
            name: "Выпечка и сдоба",
          },
          {
            name: "Хлебцы",
          },
        ],
      },
      {
        name: "Рыбная гастрономия",
        subcategories: [
          {
            name: "Икра",
          },
          {
            name: "Рыба соленая, копченая",
          },
          {
            name: "Пресервы",
          },
          {
            name: "Крабовое мясо и палочки",
          },
          {
            name: "Морепродукты свежие",
          },
        ],
      },
      {
        name: "Кулинария",
        subcategories: [
          {
            name: "Завтраки",
          },
          {
            name: "Оладьи, блинчики, пирожки",
          },
          {
            name: "Холодные блюда и закуски",
          },
          {
            name: "Соленые овощи и грибы",
          },
          {
            name: "Салаты",
          },
        ],
      },
      {
        name: "Алкоголь",
        subcategories: [
          {
            name: "Безалкогольное пиво и вино",
          },
          {
            name: "Вино",
          },
          {
            name: "Шампанское и игристое вино",
          },
          {
            name: "Крепленое вино",
          },
          {
            name: "Коньяк и бренди",
          },
        ],
      },
      {
        name: "Орехи, семена, сухофрукты",
        subcategories: [
          {
            name: "Орехи",
          },
          {
            name: "Смеси из орехов и сухофруктов",
          },
          {
            name: "Сухофрукты",
          },
          {
            name: "Семечки и семена",
          },
          {
            name: "Суперфуды",
          },
        ],
      },
      {
        name: "Масло растительное",
        subcategories: [
          {
            name: "Подсолнечное",
          },
          {
            name: "Оливковое",
          },
          {
            name: "Кокосовое",
          },
          {
            name: "Льняное",
          },
          {
            name: "Кунжутное",
          },
        ],
      },
      {
        name: "Блюда быстрого приготовления",
        subcategories: [
          {
            name: "Каши",
          },
          {
            name: "Пюре и лапша",
          },
          {
            name: "Супы, бульоны",
          },
        ],
      },
      {
        name: "Этническая кухня",
        subcategories: [
          {
            name: "Наборы и ингредиенты",
          },
          {
            name: "Этнические макаронные изделия",
          },
        ],
      },
      {
        name: "Молоко, сыр, яйца",
        subcategories: [
          {
            name: "Молоко",
          },
          {
            name: "Сливки",
          },
          {
            name: "Растительные продукты",
          },
          {
            name: "Кисломолочная продукция",
          },
          {
            name: "Творог",
          },
        ],
      },
      {
        name: "Замороженные продукты",
        subcategories: [
          {
            name: "Рыба и морепродукты",
          },
          {
            name: "Блюда и полуфабрикаты",
          },
          {
            name: "Мясо и птица",
          },
          {
            name: "Овощи, фрукты, грибы",
          },
          {
            name: "Мороженое",
          },
        ],
      },
      {
        name: "Подарочные наборы",
        subcategories: [],
      },
    ],
  },
  {
    name: "Автотовары",
    subcategories: [
      {
        name: "Рабочее место",
        subcategories: [
          {
            name: "Рабочие столы",
          },
          {
            name: "Рабочие кресла",
          },
          {
            name: "Офисные тумбы и комоды",
          },
          {
            name: "Шкафы для документов",
          },
          {
            name: "Стеллажи и этажерки",
          },
        ],
      },
      {
        name: "Мебель для геймеров",
        subcategories: [
          {
            name: "Столы для геймеров",
          },
          {
            name: "Стулья для геймеров",
          },
        ],
      },
      {
        name: "Мебель для гостиной",
        subcategories: [
          {
            name: "Мягкая мебель",
          },
          {
            name: "Журнальные столики",
          },
          {
            name: "Стеллажи и этажерки",
          },
          {
            name: "Шкафы витрины",
          },
          {
            name: "Стенки для гостиной",
          },
        ],
      },
      {
        name: "Садовая и уличная мебель",
        subcategories: [
          {
            name: "Столы для сада и улицы",
          },
          {
            name: "Стулья и кресла для сада и улицы",
          },
          {
            name: "Подвесные кресла",
          },
          {
            name: "Скамейки и диваны",
          },
          {
            name: "Гамаки",
          },
        ],
      },
      {
        name: "Столы и стулья",
        subcategories: [
          {
            name: "Компьютерные кресла",
          },
          {
            name: "Столы компьютерные и письменные",
          },
          {
            name: "Столы и столики",
          },
          {
            name: "Стулья, табуретки",
          },
          {
            name: "Банкетки, пуфики, скамьи",
          },
        ],
      },
      {
        name: "Гардеробы, шкафы и комоды",
        subcategories: [
          {
            name: "Гардеробные системы",
          },
          {
            name: "Шкафы для одежды",
          },
          {
            name: "Тумбы и комоды",
          },
        ],
      },
      {
        name: "Мебель для спальни",
        subcategories: [
          {
            name: "Кровати",
          },
          {
            name: "Матрасы",
          },
          {
            name: "Прикроватные тумбы",
          },
          {
            name: "Кушетки",
          },
          {
            name: "Раскладушки",
          },
        ],
      },
      {
        name: "Мебель для прихожей",
        subcategories: [
          {
            name: "Обувницы",
          },
          {
            name: "Вешалки (рейлы)",
          },
          {
            name: "Пуфики, банкетки и скамьи",
          },
          {
            name: "Шкафы",
          },
          {
            name: "Комплекты для прихожей",
          },
        ],
      },
      {
        name: "Детская мебель",
        subcategories: [
          {
            name: "Кровати",
          },
          {
            name: "Матрасы",
          },
          {
            name: "Шкафы для детской",
          },
          {
            name: "Комоды",
          },
          {
            name: "Стеллажи для детской",
          },
        ],
      },
      {
        name: "Надувная мебель",
        subcategories: [
          {
            name: "Надувные диваны",
          },
          {
            name: "Надувные кресла",
          },
          {
            name: "Надувные матрасы",
          },
          {
            name: "Диваны надувные",
          },
          {
            name: "Комплекты надувной мебели",
          },
        ],
      },
      {
        name: "Шкафы",
        subcategories: [
          {
            name: "Шкафы для одежды",
          },
          {
            name: "Шкафы для гостиной",
          },
          {
            name: "Шкафы для ванных",
          },
          {
            name: "Шкафы кухонные навесные",
          },
          {
            name: "Антресоли мебельные",
          },
        ],
      },
      {
        name: "Кухонные столы и стулья",
        subcategories: [
          {
            name: "Кухонные столы",
          },
          {
            name: "Кухонные стулья и табуретки",
          },
          {
            name: "Обеденные группы",
          },
          {
            name: "Кухонные уголки и диваны",
          },
          {
            name: "Барные столы",
          },
        ],
      },
      {
        name: "Мебель для кухни",
        subcategories: [
          {
            name: "Кухонные гарнитуры",
          },
          {
            name: "Модули кухонные напольные",
          },
          {
            name: "Шкафы витрины",
          },
          {
            name: "Столешницы кухонные",
          },
          {
            name: "Кухонные фартуки на стену",
          },
        ],
      },
      {
        name: "Мебель для ванной",
        subcategories: [
          {
            name: "Тумбы для ванной",
          },
          {
            name: "Шкафы для ванных комнат",
          },
          {
            name: "Мебель для ванных комнат",
          },
          {
            name: "Тележки и этажерки на колесах",
          },
          {
            name: "Полки, этажерки",
          },
        ],
      },
      {
        name: "Готовые комплекты",
        subcategories: [
          {
            name: "Спальни",
          },
          {
            name: "Кухонные гарнитуры",
          },
          {
            name: "Гостиные",
          },
          {
            name: "Прихожие",
          },
          {
            name: "Мебель для ванных комнат",
          },
        ],
      },
      {
        name: "Фурнитура для мебели и комплектующие",
        subcategories: [
          {
            name: "Фурнитура для мебели",
          },
          {
            name: "Комплектующие",
          },
          {
            name: "Насосы и аксессуары",
          },
        ],
      },
      {
        name: "Услуги установки мебели",
        subcategories: [],
      },
    ],
  },
  {
    name: "Аптека",
    subcategories: [
      {
        name: "Для птиц",
        subcategories: [
          {
            name: "Кормушки, поилки",
          },
          {
            name: "Наполнители",
          },
          {
            name: "Корма",
          },
          {
            name: "Лакомства",
          },
          {
            name: "Клетки",
          },
        ],
      },
      {
        name: "Для лошадей",
        subcategories: [
          {
            name: "Витамины и добавки для лошадей",
          },
        ],
      },
      {
        name: "Для собак",
        subcategories: [
          {
            name: "Сухие корма",
          },
          {
            name: "Влажные корма",
          },
          {
            name: "Лакомства",
          },
          {
            name: "Витамины и добавки",
          },
          {
            name: "Амуниция",
          },
        ],
      },
      {
        name: "Для грызунов и хорьков",
        subcategories: [
          {
            name: "Корма",
          },
          {
            name: "Лакомства",
          },
          {
            name: "Клетки и домики",
          },
          {
            name: "Сено и наполнители",
          },
          {
            name: "Поилки и кормушки",
          },
        ],
      },
      {
        name: "Фермерское хозяйство",
        subcategories: [
          {
            name: "Содержание с/х животных и птиц",
          },
          {
            name: "Товары для пчеловодства",
          },
          {
            name: "Инкубаторы",
          },
          {
            name: "Комбикорма",
          },
          {
            name: "Весы для животных",
          },
        ],
      },
      {
        name: "Для рыб и рептилий",
        subcategories: [
          {
            name: "Аквариумы",
          },
          {
            name: "Террариумы",
          },
          {
            name: "Оборудование для аквариумов и террариумов",
          },
          {
            name: "Декор для аквариумов и террариумов",
          },
          {
            name: "Корма",
          },
        ],
      },
      {
        name: "Ветаптека",
        subcategories: [
          {
            name: "Средства от блох и клещей",
          },
          {
            name: "Средства от глистов",
          },
          {
            name: "Витамины для животных и птиц",
          },
          {
            name: "Ветеринарные препараты",
          },
          {
            name: "Воротники и попоны",
          },
        ],
      },
    ],
  },
  {
    name: "Спорт и отдых",
    subcategories: [
      {
        name: "Фитнес и йога",
        subcategories: [
          {
            name: "Фитнес",
          },
          {
            name: "Йога и пилатес",
          },
          {
            name: "Гимнастика",
          },
          {
            name: "Подарочные сертификаты на фитнес и спорт",
          },
        ],
      },
      {
        name: "Рюкзаки и сумки",
        subcategories: [
          {
            name: "Рюкзаки",
          },
          {
            name: "Спортивные сумки",
          },
        ],
      },
      {
        name: "Командный спорт",
        subcategories: [
          {
            name: "Футбол",
          },
          {
            name: "Баскетбол",
          },
          {
            name: "Хоккей",
          },
          {
            name: "Волейбол",
          },
          {
            name: "Регби и гандбол",
          },
        ],
      },
      {
        name: "Конный спорт и товары для гольфа",
        subcategories: [
          {
            name: "Аксессуары для гольфа",
          },
          {
            name: "Амуниции для защиты лошадей",
          },
          {
            name: "Амуниции для седловки",
          },
          {
            name: "Амуниции для управления лошадьми",
          },
          {
            name: "Клюшки для гольфа",
          },
        ],
      },
      {
        name: "Бег и спортивная ходьба",
        subcategories: [
          {
            name: "Гаджеты для бега",
          },
          {
            name: "Поясные спортивные сумки",
          },
          {
            name: "Рюкзаки для бега",
          },
          {
            name: "Женская обувь для бега",
          },
          {
            name: "Мужская обувь для бега",
          },
        ],
      },
      {
        name: "Велоспорт",
        subcategories: [
          {
            name: "Велосипеды",
          },
          {
            name: "Электровелосипеды",
          },
          {
            name: "Детские",
          },
          {
            name: "Женские",
          },
          {
            name: "Складные",
          },
        ],
      },
      {
        name: "Детский спорт",
        subcategories: [
          {
            name: "Зимний спорт",
          },
          {
            name: "Спорт дома",
          },
          {
            name: "Детская площадка",
          },
          {
            name: "Детский транспорт",
          },
          {
            name: "Летний спорт",
          },
        ],
      },
      {
        name: "Спортпит",
        subcategories: [
          {
            name: "Протеины",
          },
          {
            name: "Протеиновые батончики",
          },
          {
            name: "Гейнеры",
          },
          {
            name: "Аминокислоты и BCAA",
          },
          {
            name: "Препараты для укрепления связок и суставов",
          },
        ],
      },
      {
        name: "Бокс и единоборства",
        subcategories: [
          {
            name: "Перчатки",
          },
          {
            name: "Тренировочные снаряды",
          },
          {
            name: "Шлемы и защита",
          },
          {
            name: "Аксессуары и принадлежности",
          },
          {
            name: "Мужская одежда",
          },
        ],
      },
      {
        name: "Охота и рыбалка",
        subcategories: [
          {
            name: "Товары для рыбалки",
          },
          {
            name: "Товары для охоты",
          },
          {
            name: "Сумки и ящики",
          },
          {
            name: "Одежда для охоты и рыбалки",
          },
          {
            name: "Обувь для охоты и рыбалки",
          },
        ],
      },
      {
        name: "Спортивные игры",
        subcategories: [
          {
            name: "Большой теннис",
          },
          {
            name: "Настольный теннис",
          },
          {
            name: "Бадминтон",
          },
          {
            name: "Сквош",
          },
          {
            name: "Дартс",
          },
        ],
      },
      {
        name: "Стрелковый спорт",
        subcategories: [
          {
            name: "Луки и арбалеты",
          },
          {
            name: "Аксессуары и запчасти",
          },
          {
            name: "Пневматическое и страйкбольное оружие",
          },
        ],
      },
      {
        name: "Спортивная одежда и обувь",
        subcategories: [
          {
            name: "Женщинам",
          },
          {
            name: "Мужчинам",
          },
          {
            name: "Детям",
          },
        ],
      },
      {
        name: "Самокаты и аксессуары",
        subcategories: [
          {
            name: "Самокаты",
          },
          {
            name: "Электросамокаты",
          },
          {
            name: "Детские",
          },
          {
            name: "Для взрослых",
          },
          {
            name: "Аксессуары",
          },
        ],
      },
      {
        name: "Фитнес-клубы",
        subcategories: [
          {
            name: "Абонементы",
          },
        ],
      },
      {
        name: "Тренажеры",
        subcategories: [
          {
            name: "Кардиотренажеры",
          },
          {
            name: "Свободные веса",
          },
          {
            name: "Силовые тренажеры",
          },
          {
            name: "Собственный вес",
          },
          {
            name: "Инверсионные столы",
          },
        ],
      },
      {
        name: "Спортивная защита",
        subcategories: [
          {
            name: "Защита голени, голеностопа и стопы",
          },
          {
            name: "Защита запястий и предплечий",
          },
          {
            name: "Защита колена",
          },
          {
            name: "Защита локтя",
          },
          {
            name: "Защита пальцев",
          },
        ],
      },
      {
        name: "Туризм и активный отдых",
        subcategories: [
          {
            name: "Палатки, тенты и спальники",
          },
          {
            name: "Рюкзаки для туризма",
          },
          {
            name: "Гермомешки",
          },
          {
            name: "Походная мебель",
          },
          {
            name: "Палки для скандинавской ходьбы и треккинга",
          },
        ],
      },
      {
        name: "Альпинизм",
        subcategories: [
          {
            name: "Аксессуары",
          },
          {
            name: "Скальные туфли",
          },
          {
            name: "Карабины",
          },
          {
            name: "Веревки и шнуры",
          },
          {
            name: "Каски",
          },
        ],
      },
      {
        name: "Водный спорт",
        subcategories: [
          {
            name: "Лодки, байдарки и комплектующие",
          },
          {
            name: "Серфинг и водные лыжи",
          },
          {
            name: "Плавание в бассейне",
          },
          {
            name: "Круги и матрасы для плавания",
          },
          {
            name: "Спасательные жилеты и круги",
          },
        ],
      },
      {
        name: "Электротранспорт",
        subcategories: [
          {
            name: "Электровелосипеды",
          },
          {
            name: "Моноколеса",
          },
          {
            name: "Гироскутеры",
          },
          {
            name: "Электросамокаты",
          },
          {
            name: "Электроскейты",
          },
        ],
      },
      {
        name: "Скейты, ролики",
        subcategories: [
          {
            name: "Скейтборды и лонгборды",
          },
          {
            name: "Роликовые коньки",
          },
          {
            name: "Лыжероллеры",
          },
          {
            name: "Спортивная защита",
          },
        ],
      },
    ],
  },
  {
    name: "Товары ИКЕА",
    subcategories: [
      {
        name: "Интерьер",
        subcategories: [
          {
            name: "Искусственные растения и сухоцветы",
          },
          {
            name: "Горшки, подставки для цветов",
          },
          {
            name: "Шторы",
          },
          {
            name: "Картины, постеры, гобелены, панно",
          },
          {
            name: "Декоративные свечи",
          },
        ],
      },
      {
        name: "Организация пространства",
        subcategories: [
          {
            name: "Корзины, коробки и органайзеры",
          },
          {
            name: "Вешалки настенные",
          },
          {
            name: "Вешалки-плечики для одежды",
          },
        ],
      },
      {
        name: "Ванная",
        subcategories: [
          {
            name: "Мыльницы, стаканы и дозаторы",
          },
          {
            name: "Коврики для ванной и туалета",
          },
          {
            name: "Держатели и крючки для ванной и туалета",
          },
          {
            name: "Зеркала косметические",
          },
          {
            name: "Мочалки и щетки для ванны и душа",
          },
        ],
      },
      {
        name: "Бытовая техника",
        subcategories: [
          {
            name: "Кухонные вытяжки",
          },
          {
            name: "Кухонные весы",
          },
        ],
      },
      {
        name: "Товары для животных",
        subcategories: [
          {
            name: "Лежаки, домики, спальные места для кошек и собак",
          },
          {
            name: "Поилки и кормушки для кошек и собак, птиц",
          },
        ],
      },
      {
        name: "Упаковочные материалы",
        subcategories: [],
      },
      {
        name: "Кухни",
        subcategories: [
          {
            name: "Фасады и дверцы",
          },
          {
            name: "Комплектующие",
          },
          {
            name: "Фурнитура для мебели",
          },
          {
            name: "Кухонные мойки",
          },
          {
            name: "Смесители",
          },
        ],
      },
      {
        name: "Освещение",
        subcategories: [
          {
            name: "Настольные лампы и светильники",
          },
          {
            name: "Шнуры и плафоны",
          },
          {
            name: "Люстры и потолочные светильники",
          },
          {
            name: "Лампочки",
          },
          {
            name: "Интерьерная подсветка",
          },
        ],
      },
      {
        name: "Уборка",
        subcategories: [
          {
            name: "Мусорные ведра и баки",
          },
          {
            name: "Швабры и насадки",
          },
          {
            name: "Маски и шапочки защитные",
          },
          {
            name: "Мешки для мусора",
          },
        ],
      },
      {
        name: "Аксессуары для электроники и компьютерной техники",
        subcategories: [
          {
            name: "Батарейки и аккумуляторы для аудио- и видеотехники",
          },
          {
            name: "Аксессуары для наушников и гарнитур",
          },
          {
            name: "Шлюзы умного дома",
          },
          {
            name: "Подставки и держатели для мобильных устройств",
          },
          {
            name: "Кабели, разъемы, переходники для компьютеров и электроники",
          },
        ],
      },
      {
        name: "Строительство и ремонт",
        subcategories: [
          {
            name: "Сантехника",
          },
          {
            name: "Электрика",
          },
          {
            name: "Материалы и инструменты",
          },
        ],
      },
      {
        name: "Одежда, обувь и аксессуары",
        subcategories: [
          {
            name: "Сумки",
          },
          {
            name: "Дорожные и спортивные сумки",
          },
          {
            name: "Брелоки и ключницы",
          },
          {
            name: "Дорожные аксессуары",
          },
          {
            name: "Подставки и держатели для украшений",
          },
        ],
      },
      {
        name: "Новый год. Распродажа",
        subcategories: [
          {
            name: "Подарочная упаковка",
          },
          {
            name: "Электрические гирлянды",
          },
          {
            name: "Новогодний декор",
          },
          {
            name: "Открытки",
          },
          {
            name: "Украшения для организации праздников",
          },
        ],
      },
      {
        name: "Текстиль",
        subcategories: [
          {
            name: "Декоративные подушки",
          },
          {
            name: "Ковры и ковровые дорожки",
          },
          {
            name: "Комплекты постельного белья",
          },
          {
            name: "Полотенца",
          },
          {
            name: "Простыни",
          },
        ],
      },
      {
        name: "Кухонная посуда",
        subcategories: [
          {
            name: "Сковороды и сотейники",
          },
          {
            name: "Кухонная навеска",
          },
          {
            name: "Посуда и формы для выпечки и запекания",
          },
          {
            name: "Кастрюли и ковши",
          },
          {
            name: "Крышки для посуды",
          },
        ],
      },
      {
        name: "Уход за одеждой и обувью",
        subcategories: [
          {
            name: "Сушилки и формодержатели для обуви",
          },
        ],
      },
      {
        name: "Детские товары",
        subcategories: [
          {
            name: "Игрушки и игры",
          },
          {
            name: "Товары для мам и малышей",
          },
          {
            name: "Товары для школы",
          },
          {
            name: "Хобби и творчество",
          },
        ],
      },
      {
        name: "Дача, сад и огород",
        subcategories: [
          {
            name: "Инструменты для приготовления барбекю",
          },
          {
            name: "Садовые кресла и стулья",
          },
          {
            name: "Садовые шатры",
          },
        ],
      },
      {
        name: "Спорт и отдых",
        subcategories: [
          {
            name: "Рюкзаки спортивные и городские",
          },
          {
            name: "Тенты и шатры туристические",
          },
        ],
      },
    ],
  },
  {
    name: "Ювелирные украшения",
    subcategories: [
      {
        name: "Цепи",
        subcategories: [
          {
            name: "Цепочки ювелирные",
          },
          {
            name: "Шнурки ювелирные",
          },
        ],
      },
      {
        name: "Колье",
        subcategories: [
          {
            name: "Бусы ювелирные",
          },
          {
            name: "Колье ювелирные",
          },
          {
            name: "Чётки ювелирные",
          },
          {
            name: "Чокеры ювелирные",
          },
        ],
      },
      {
        name: "Запонки и зажимы",
        subcategories: [
          {
            name: "Зажимы ювелирные",
          },
          {
            name: "Запонки ювелирные",
          },
        ],
      },
      {
        name: "Ювелирная посуда и сувениры",
        subcategories: [
          {
            name: "Посуда ювелирная",
          },
          {
            name: "Предметы интерьера ювелирные",
          },
          {
            name: "Предметы религии ювелирные",
          },
          {
            name: "Приборы столовые ювелирные",
          },
          {
            name: "Сувениры ювелирные",
          },
        ],
      },
      {
        name: "Украшения для женщин",
        subcategories: [],
      },
      {
        name: "Серебряные украшения",
        subcategories: [],
      },
      {
        name: "Украшения с рубинами",
        subcategories: [],
      },
      {
        name: "Украшения с фианитами",
        subcategories: [],
      },
      {
        name: "Чистящие средства",
        subcategories: [],
      },
      {
        name: "Кольца и перстни",
        subcategories: [
          {
            name: "Кольца ювелирные",
          },
          {
            name: "Наборы ювелирных колец",
          },
        ],
      },
      {
        name: "Кулоны и подвески",
        subcategories: [
          {
            name: "Иконки ювелирные",
          },
          {
            name: "Крестики ювелирные",
          },
          {
            name: "Наборы подвесок ювелирных",
          },
          {
            name: "Подвески ювелирные",
          },
          {
            name: "Шармы ювелирные",
          },
        ],
      },
      {
        name: "Броши",
        subcategories: [
          {
            name: "Броши ювелирные",
          },
          {
            name: "Знаки различия ВС ювелирные",
          },
          {
            name: "Значки ювелирные",
          },
        ],
      },
      {
        name: "Комплекты",
        subcategories: [],
      },
      {
        name: "Религиозные изделия",
        subcategories: [],
      },
      {
        name: "Украшения для мужчин",
        subcategories: [],
      },
      {
        name: "Золотые украшения",
        subcategories: [],
      },
      {
        name: "Украшения с изумрудами",
        subcategories: [],
      },
      {
        name: "Украшения с топазами",
        subcategories: [],
      },
      {
        name: "Обручальные кольца",
        subcategories: [],
      },
      {
        name: "Браслеты",
        subcategories: [
          {
            name: "Браслеты ювелирные",
          },
          {
            name: "Наборы браслетов ювелирных",
          },
          {
            name: "Платежные аксессуары ювелирные",
          },
        ],
      },
      {
        name: "Пирсинг",
        subcategories: [
          {
            name: "Браслеты на ногу ювелирные",
          },
          {
            name: "Диадемы ювелирные",
          },
          {
            name: "Заколки ювелирные",
          },
          {
            name: "Клипсы для имитации пирсинга ювелирные",
          },
          {
            name: "Кольца на палец ноги ювелирные",
          },
        ],
      },
      {
        name: "Часы",
        subcategories: [
          {
            name: "Браслеты для часов ювелирные",
          },
          {
            name: "Часы-кулон ювелирные",
          },
          {
            name: "Часы ювелирные карманные",
          },
          {
            name: "Часы ювелирные наручные",
          },
        ],
      },
      {
        name: "Шармы",
        subcategories: [],
      },
      {
        name: "Детские ювелирные украшения",
        subcategories: [],
      },
      {
        name: "Украшения с бриллиантами",
        subcategories: [],
      },
      {
        name: "Украшения с жемчугом",
        subcategories: [],
      },
      {
        name: "Украшения с сапфирами",
        subcategories: [],
      },
    ],
  },
  {
    name: "Книги",
    subcategories: [
      {
        name: "Новинки",
        subcategories: [],
      },
      {
        name: "Эзотерика",
        subcategories: [],
      },
      {
        name: "Книги для детей",
        subcategories: [
          {
            name: "Премия «Ясная Поляна»",
          },
          {
            name: "Премия «Просветитель»",
          },
          {
            name: "Книги для малышей",
          },
          {
            name: "Детская художественная литература",
          },
          {
            name: "Познавательная литература",
          },
        ],
      },
      {
        name: "Бизнес и финансы",
        subcategories: [
          {
            name: "Бизнес-планирование",
          },
          {
            name: "Бухгалтерский учет и аудит",
          },
          {
            name: "Инвестиции и трейдинг",
          },
          {
            name: "Истории успеха",
          },
          {
            name: "Культура бизнеса и деловой этикет",
          },
        ],
      },
      {
        name: "Нехудожественная литература",
        subcategories: [
          {
            name: "Государство и право",
          },
          {
            name: "Информационные технологии",
          },
          {
            name: "Искусство и культура",
          },
          {
            name: "История",
          },
          {
            name: "Красота и образ жизни",
          },
        ],
      },
      {
        name: "Журналы и газеты",
        subcategories: [],
      },
      {
        name: "Любовь и эротика",
        subcategories: [],
      },
      {
        name: "Цифровые книги на физическом носителе",
        subcategories: [],
      },
      {
        name: "Топ-100",
        subcategories: [],
      },
      {
        name: "Премия «Большая книга»",
        subcategories: [],
      },
      {
        name: "Аудиокниги",
        subcategories: [],
      },
      {
        name: "Художественная литература",
        subcategories: [
          {
            name: "Фантастика и фэнтези",
          },
          {
            name: "Детективы, триллеры, ужасы",
          },
          {
            name: "Современная проза",
          },
          {
            name: "Любовные романы",
          },
          {
            name: "Исторические романы",
          },
        ],
      },
      {
        name: "Психология и саморазвитие",
        subcategories: [
          {
            name: "Деньги и успех",
          },
          {
            name: "Детская психология и воспитание",
          },
          {
            name: "Личная эффективность и мотивация",
          },
          {
            name: "Личность и характер",
          },
          {
            name: "Научная психология",
          },
        ],
      },
      {
        name: "Литература на иностранных языках",
        subcategories: [
          {
            name: "Английский",
          },
          {
            name: "Китайский",
          },
          {
            name: "Испанский",
          },
          {
            name: "Итальянский",
          },
          {
            name: "Немецкий",
          },
        ],
      },
      {
        name: "Календари",
        subcategories: [],
      },
      {
        name: "Букинистика",
        subcategories: [
          {
            name: "Нехудожественная литература",
          },
          {
            name: "Художественная литература",
          },
          {
            name: "Комиксы и манга",
          },
          {
            name: "Журналы и газеты",
          },
          {
            name: "Учебная литература",
          },
        ],
      },
      {
        name: "Раскраски",
        subcategories: [],
      },
      {
        name: "Топ-100 детских книг",
        subcategories: [],
      },
      {
        name: "Азиатская литература",
        subcategories: [],
      },
      {
        name: "Цифровые книги",
        subcategories: [],
      },
      {
        name: "Учебная литература",
        subcategories: [
          {
            name: "Подготовка к школе",
          },
          {
            name: "Школьникам",
          },
          {
            name: "Иностранные языки",
          },
          {
            name: "Дополнительное образование для детей",
          },
          {
            name: "Студентам и абитуриентам",
          },
        ],
      },
      {
        name: "Дом и хобби",
        subcategories: [
          {
            name: "Дом и сад",
          },
          {
            name: "Рукоделие",
          },
          {
            name: "Домашние животные",
          },
          {
            name: "Досуг",
          },
          {
            name: "Кулинария",
          },
        ],
      },
      {
        name: "Комиксы и манга",
        subcategories: [
          {
            name: "Комиксы",
          },
          {
            name: "Манга",
          },
          {
            name: "Артбуки, игровые вселенные",
          },
          {
            name: "Экранизации",
          },
          {
            name: "Образовательные комиксы",
          },
        ],
      },
      {
        name: "Подарочные издания",
        subcategories: [],
      },
      {
        name: "Аудиокниги на физическом носителе",
        subcategories: [],
      },
      {
        name: "Книги Азии",
        subcategories: [],
      },
    ],
  },
  {
    name: "Хобби и творчество",
    subcategories: [
      {
        name: "Поделки",
        subcategories: [
          {
            name: "Поделки и аппликации",
          },
          {
            name: "3D-ручки",
          },
          {
            name: "Товары для декорирования",
          },
          {
            name: "Наклейки для творчества",
          },
          {
            name: "Выжигание и выпиливание",
          },
        ],
      },
      {
        name: "Вязание",
        subcategories: [
          {
            name: "Пряжа",
          },
          {
            name: "Спицы",
          },
          {
            name: "Крючки",
          },
          {
            name: "Наборы для вязания",
          },
          {
            name: "Инструменты и аксессуары",
          },
        ],
      },
      {
        name: "Декупаж",
        subcategories: [
          {
            name: "Лак и клей",
          },
          {
            name: "Наборы для декупажа",
          },
          {
            name: "Карты, салфетки, бумага",
          },
        ],
      },
      {
        name: "Наборы для опытов и исследований",
        subcategories: [
          {
            name: "Наборы для исследований",
          },
          {
            name: "Детские микроскопы и телескопы",
          },
        ],
      },
      {
        name: "Шитье и вышивание",
        subcategories: [
          {
            name: "Ткани, кожа и замша",
          },
          {
            name: "Канва и наборы для вышивания",
          },
          {
            name: "Инструменты и аксессуары",
          },
          {
            name: "Декоративные элементы",
          },
          {
            name: "Нитки, мулине, шнуры",
          },
        ],
      },
      {
        name: "Сборные модели и аксессуары",
        subcategories: [
          {
            name: "Сборные модели",
          },
          {
            name: "Румбоксы",
          },
          {
            name: "Аксессуары",
          },
        ],
      },
      {
        name: "Лепка",
        subcategories: [
          {
            name: "Пластилин и масса для лепки",
          },
          {
            name: "Гипс для литья и лепки",
          },
          {
            name: "Глина для лепки",
          },
          {
            name: "Кинетический песок",
          },
          {
            name: "Инструменты для лепки",
          },
        ],
      },
      {
        name: "Скрапбукинг",
        subcategories: [
          {
            name: "Бумага и наборы",
          },
          {
            name: "Украшения и декоративные элементы",
          },
          {
            name: "Инструменты и аксессуары",
          },
        ],
      },
      {
        name: "Пазлы и головоломки",
        subcategories: [
          {
            name: "Пазлы",
          },
          {
            name: "Головоломки",
          },
        ],
      },
      {
        name: "Рукоделие",
        subcategories: [
          {
            name: "Алмазная мозаика",
          },
          {
            name: "Валяние",
          },
          {
            name: "Квиллинг",
          },
        ],
      },
      {
        name: "Бисер и создание украшений",
        subcategories: [
          {
            name: "Наборы для создания украшений",
          },
          {
            name: "Фурнитура для украшений",
          },
        ],
      },
      {
        name: "Изготовление мыла, свечей, косметики",
        subcategories: [
          {
            name: "Изготовление свечей",
          },
          {
            name: "Мыльная основа, краситель, отдушка",
          },
          {
            name: "Изготовление косметики",
          },
          {
            name: "Формы для мыла",
          },
          {
            name: "Наборы для мыловарения",
          },
        ],
      },
    ],
  },
  {
    name: "Досуг и развлечения",
    subcategories: [
      {
        name: "Цепи",
        subcategories: [
          {
            name: "Цепочки ювелирные",
          },
          {
            name: "Шнурки ювелирные",
          },
        ],
      },
      {
        name: "Колье",
        subcategories: [
          {
            name: "Бусы ювелирные",
          },
          {
            name: "Колье ювелирные",
          },
          {
            name: "Чётки ювелирные",
          },
          {
            name: "Чокеры ювелирные",
          },
        ],
      },
      {
        name: "Запонки и зажимы",
        subcategories: [
          {
            name: "Зажимы ювелирные",
          },
          {
            name: "Запонки ювелирные",
          },
        ],
      },
      {
        name: "Ювелирная посуда и сувениры",
        subcategories: [
          {
            name: "Посуда ювелирная",
          },
          {
            name: "Предметы интерьера ювелирные",
          },
          {
            name: "Предметы религии ювелирные",
          },
          {
            name: "Приборы столовые ювелирные",
          },
          {
            name: "Сувениры ювелирные",
          },
        ],
      },
      {
        name: "Украшения для женщин",
        subcategories: [],
      },
      {
        name: "Серебряные украшения",
        subcategories: [],
      },
      {
        name: "Украшения с рубинами",
        subcategories: [],
      },
      {
        name: "Украшения с фианитами",
        subcategories: [],
      },
      {
        name: "Чистящие средства",
        subcategories: [],
      },
      {
        name: "Кольца и перстни",
        subcategories: [
          {
            name: "Кольца ювелирные",
          },
          {
            name: "Наборы ювелирных колец",
          },
        ],
      },
      {
        name: "Кулоны и подвески",
        subcategories: [
          {
            name: "Иконки ювелирные",
          },
          {
            name: "Крестики ювелирные",
          },
          {
            name: "Наборы подвесок ювелирных",
          },
          {
            name: "Подвески ювелирные",
          },
          {
            name: "Шармы ювелирные",
          },
        ],
      },
      {
        name: "Броши",
        subcategories: [
          {
            name: "Броши ювелирные",
          },
          {
            name: "Знаки различия ВС ювелирные",
          },
          {
            name: "Значки ювелирные",
          },
        ],
      },
      {
        name: "Комплекты",
        subcategories: [],
      },
      {
        name: "Религиозные изделия",
        subcategories: [],
      },
      {
        name: "Украшения для мужчин",
        subcategories: [],
      },
      {
        name: "Золотые украшения",
        subcategories: [],
      },
      {
        name: "Украшения с изумрудами",
        subcategories: [],
      },
      {
        name: "Украшения с топазами",
        subcategories: [],
      },
      {
        name: "Обручальные кольца",
        subcategories: [],
      },
      {
        name: "Браслеты",
        subcategories: [
          {
            name: "Браслеты ювелирные",
          },
          {
            name: "Наборы браслетов ювелирных",
          },
          {
            name: "Платежные аксессуары ювелирные",
          },
        ],
      },
      {
        name: "Пирсинг",
        subcategories: [
          {
            name: "Браслеты на ногу ювелирные",
          },
          {
            name: "Диадемы ювелирные",
          },
          {
            name: "Заколки ювелирные",
          },
          {
            name: "Клипсы для имитации пирсинга ювелирные",
          },
          {
            name: "Кольца на палец ноги ювелирные",
          },
        ],
      },
      {
        name: "Часы",
        subcategories: [
          {
            name: "Браслеты для часов ювелирные",
          },
          {
            name: "Часы-кулон ювелирные",
          },
          {
            name: "Часы ювелирные карманные",
          },
          {
            name: "Часы ювелирные наручные",
          },
        ],
      },
      {
        name: "Шармы",
        subcategories: [],
      },
      {
        name: "Детские ювелирные украшения",
        subcategories: [],
      },
      {
        name: "Украшения с бриллиантами",
        subcategories: [],
      },
      {
        name: "Украшения с жемчугом",
        subcategories: [],
      },
      {
        name: "Украшения с сапфирами",
        subcategories: [],
      },
    ],
  },
  {
    name: "Для школы и офиса",
    subcategories: [
      {
        name: "Пеналы и письменные принадлежности",
        subcategories: [
          {
            name: "Пеналы",
          },
          {
            name: "Ручки",
          },
          {
            name: "Канцелярские наборы",
          },
          {
            name: "Стержни, чернила для ручек",
          },
          {
            name: "Карандаши чернографитные",
          },
        ],
      },
      {
        name: "Развивающие пособия и материалы",
        subcategories: [
          {
            name: "Авторские методики и материалы",
          },
          {
            name: "Учебные пособия",
          },
          {
            name: "Дидактические карточки",
          },
          {
            name: "Детские компьютеры",
          },
          {
            name: "Обучающие плакаты",
          },
        ],
      },
      {
        name: "Уроки рисования",
        subcategories: [
          {
            name: "Альбомы для рисования",
          },
          {
            name: "Кисти",
          },
          {
            name: "Краски",
          },
          {
            name: "Пастель и мелки",
          },
          {
            name: "Цветные карандаши",
          },
        ],
      },
      {
        name: "Демонстрационные доски",
        subcategories: [
          {
            name: "Флипчарты",
          },
          {
            name: "Магнитно-маркерные доски",
          },
          {
            name: "Пробковые доски",
          },
          {
            name: "Меловые доски",
          },
          {
            name: "Магнитно-меловые доски",
          },
        ],
      },
      {
        name: "Школьная форма для мальчиков",
        subcategories: [
          {
            name: "Брюки",
          },
          {
            name: "Рубашки",
          },
          {
            name: "Жилеты",
          },
          {
            name: "Пиджаки",
          },
          {
            name: "Комплекты и форма",
          },
        ],
      },
      {
        name: "Тетради, блокноты, дневники",
        subcategories: [
          {
            name: "Тетради для школы",
          },
          {
            name: "Дневники",
          },
          {
            name: "Нотные тетради",
          },
          {
            name: "Обложки",
          },
          {
            name: "Ежедневники",
          },
        ],
      },
      {
        name: "Чертежные инструменты",
        subcategories: [
          {
            name: "Готовальни",
          },
          {
            name: "Доски чертёжные",
          },
          {
            name: "Изографы",
          },
          {
            name: "Линейки чертежные",
          },
          {
            name: "Наборы чертёжные",
          },
        ],
      },
      {
        name: "Школьные глобусы",
        subcategories: [],
      },
      {
        name: "Уроки технологии",
        subcategories: [
          {
            name: "Металлические конструкторы",
          },
          {
            name: "Цветная бумага и картон",
          },
          {
            name: "Клей",
          },
          {
            name: "Ножницы",
          },
          {
            name: "Одежда для уроков труда",
          },
        ],
      },
      {
        name: "Комната ученика",
        subcategories: [
          {
            name: "Парты",
          },
          {
            name: "Столы компьютерные и письменные",
          },
          {
            name: "Компьютерные кресла",
          },
          {
            name: "Настольные лампы и светильники",
          },
          {
            name: "Стеллажи",
          },
        ],
      },
      {
        name: "Офисная бумага и пленка",
        subcategories: [],
      },
      {
        name: "Канцелярские товары",
        subcategories: [
          {
            name: "Файлы и папки",
          },
          {
            name: "Канцелярские наборы",
          },
          {
            name: "Лотки для бумаги",
          },
          {
            name: "Точилки",
          },
          {
            name: "Калькуляторы",
          },
        ],
      },
      {
        name: "Карты",
        subcategories: [],
      },
      {
        name: "Доски и мольберты",
        subcategories: [],
      },
      {
        name: "Школьная форма для девочек",
        subcategories: [
          {
            name: "Платья",
          },
          {
            name: "Юбки",
          },
          {
            name: "Брюки",
          },
          {
            name: "Рубашки и блузы",
          },
          {
            name: "Жилеты",
          },
        ],
      },
    ],
  },
  {
    name: "Ноутбуки и компьютеры",
    subcategories: [
      {
        name: "Мониторы и аксессуары",
        subcategories: [
          {
            name: "Мониторы",
          },
          {
            name: "Кабели, разъемы, переходники",
          },
          {
            name: "Кронштейны, держатели и подставки",
          },
          {
            name: "Чистящие принадлежности",
          },
          {
            name: "Очки для компьютера",
          },
        ],
      },
      {
        name: "Оргтехника и расходные материалы",
        subcategories: [
          {
            name: "Принтеры, сканеры, копиры",
          },
          {
            name: "Ламинаторы, брошюровщики, резаки",
          },
          {
            name: "Уничтожители бумаг (шредеры)",
          },
          {
            name: "Аксессуары и запчасти",
          },
          {
            name: "Оборудование для связи",
          },
        ],
      },
      {
        name: "Программное обеспечение",
        subcategories: [
          {
            name: "Все программы",
          },
          {
            name: "Игры для приставок и ПК",
          },
          {
            name: "Антивирусы",
          },
          {
            name: "Операционные системы",
          },
          {
            name: "Офисные программы",
          },
        ],
      },
      {
        name: "Батарейки и электропитание",
        subcategories: [
          {
            name: "Батарейки и аккумуляторы",
          },
          {
            name: "Зарядные устройства для стандартных аккумуляторов",
          },
          {
            name: "Удлинители и сетевые фильтры",
          },
          {
            name: "Источники бесперебойного питания",
          },
          {
            name: "Аккумуляторные батареи",
          },
        ],
      },
      {
        name: "Настольные ПК и моноблоки",
        subcategories: [
          {
            name: "Настольные компьютеры",
          },
          {
            name: "Моноблоки",
          },
        ],
      },
      {
        name: "Гейминг",
        subcategories: [
          {
            name: "Игровые ноутбуки",
          },
          {
            name: "Игры",
          },
          {
            name: "Мобильный гейминг",
          },
          {
            name: "PlayStation",
          },
          {
            name: "Xbox",
          },
        ],
      },
      {
        name: "Сетевое оборудование",
        subcategories: [
          {
            name: "Роутеры",
          },
          {
            name: "Модемы",
          },
          {
            name: "Беспроводное оборудование",
          },
          {
            name: "3G/4G модемы и роутеры",
          },
          {
            name: "Сетевые хранилища (NAS)",
          },
        ],
      },
      {
        name: "Оборудование для презентаций",
        subcategories: [
          {
            name: "Мультимедиа-проекторы",
          },
          {
            name: "Экраны",
          },
          {
            name: "Аксессуары и запчасти для проекторов",
          },
          {
            name: "Лампы для проекторов",
          },
          {
            name: "Интерактивные доски и аксессуары",
          },
        ],
      },
      {
        name: "Компьютерная мебель",
        subcategories: [
          {
            name: "Кронштейны, держатели и подставки",
          },
          {
            name: "Подставки для ног",
          },
        ],
      },
      {
        name: "Комплектующие для ПК",
        subcategories: [
          {
            name: "Видеокарты",
          },
          {
            name: "Процессоры (CPU)",
          },
          {
            name: "Внутренние SSD накопители",
          },
          {
            name: "Оперативная память",
          },
          {
            name: "Внешние жесткие диски и SSD",
          },
        ],
      },
      {
        name: "Периферийные устройства",
        subcategories: [
          {
            name: "Мониторы",
          },
          {
            name: "Клавиатуры",
          },
          {
            name: "Мыши",
          },
          {
            name: "Комплекты клавиатур и мышей",
          },
          {
            name: "Рули, джойстики, геймпады",
          },
        ],
      },
      {
        name: "Накопители данных",
        subcategories: [
          {
            name: "Внутренние SSD накопители",
          },
          {
            name: "Внешние жесткие диски и SSD",
          },
          {
            name: "Внутренние жесткие диски",
          },
          {
            name: "Сетевые хранилища (NAS)",
          },
          {
            name: "Карты памяти",
          },
        ],
      },
      {
        name: "Серверы и СКС",
        subcategories: [
          {
            name: "Серверы",
          },
          {
            name: "Аксессуары для серверов",
          },
          {
            name: "Комплектующие для серверов",
          },
          {
            name: "СКС оборудование",
          },
        ],
      },
    ],
  },
  {
    name: "Все для гейминга",
    subcategories: [
      {
        name: "Игровые компьютеры",
        subcategories: [],
      },
      {
        name: "PlayStation",
        subcategories: [
          {
            name: "Игровые приставки",
          },
          {
            name: "Игры для PlayStation",
          },
          {
            name: "Геймпады и рули для PlayStation",
          },
          {
            name: "Шлемы VR",
          },
          {
            name: "Карты оплаты и подписки",
          },
        ],
      },
      {
        name: "4K гейминг",
        subcategories: [
          {
            name: "Игровые приставки с поддержкой 4К игр",
          },
          {
            name: "Игровые ноутбуки с 4К разрешением",
          },
          {
            name: "Игровые ПК для 4К игр",
          },
          {
            name: "Игровые мониторы с 4K разрешением",
          },
        ],
      },
      {
        name: "Настольные игры",
        subcategories: [],
      },
      {
        name: "Стриминг",
        subcategories: [
          {
            name: "Видеозахват",
          },
          {
            name: "Хромакеи",
          },
          {
            name: "Микрофоны",
          },
          {
            name: "Веб-камеры",
          },
        ],
      },
      {
        name: "Аксессуары для консолей",
        subcategories: [],
      },
      {
        name: "Ретроконсоли",
        subcategories: [],
      },
      {
        name: "Игры",
        subcategories: [
          {
            name: "Игры для PlayStation 4",
          },
          {
            name: "Игры для Xbox ONE",
          },
          {
            name: "Игры для Nintendo Switch",
          },
          {
            name: "Игры для PC",
          },
          {
            name: "Все игры",
          },
        ],
      },
      {
        name: "Xbox",
        subcategories: [
          {
            name: "Игровые приставки",
          },
          {
            name: "Игры для Xbox",
          },
          {
            name: "Геймпады и рули",
          },
          {
            name: "Карты оплаты и подписки",
          },
          {
            name: "Аксессуары для приставок",
          },
        ],
      },
      {
        name: "Игровая периферия",
        subcategories: [
          {
            name: "Рули, джойстики, геймпады",
          },
          {
            name: "Игровые мышки",
          },
          {
            name: "Коврики для мышек",
          },
          {
            name: "Игровые клавиатуры",
          },
          {
            name: "Комплекты клавиатур и мышек",
          },
        ],
      },
      {
        name: "Очки виртуальной реальности",
        subcategories: [],
      },
      {
        name: "Столы для гейминга",
        subcategories: [],
      },
      {
        name: "Фигурки Funko для настоящих фанатов",
        subcategories: [],
      },
      {
        name: "Игровые ноутбуки",
        subcategories: [],
      },
      {
        name: "Мобильный гейминг",
        subcategories: [
          {
            name: "Игровые телефоны",
          },
          {
            name: "Триггеры и геймпады для телефонов",
          },
          {
            name: "Игровые планшеты",
          },
          {
            name: "Портативные игровые приставки",
          },
          {
            name: "Очки виртуальной реальности для смартфонов",
          },
        ],
      },
      {
        name: "Nintendo",
        subcategories: [
          {
            name: "Игровые приставки",
          },
          {
            name: "Игры для Nintendo",
          },
          {
            name: "Геймпады и рули",
          },
          {
            name: "Аксессуары для приставок",
          },
        ],
      },
      {
        name: "Игровые комплектующие",
        subcategories: [
          {
            name: "Видеокарты",
          },
          {
            name: "Процессоры",
          },
          {
            name: "Оперативная память",
          },
          {
            name: "SSD накопители",
          },
          {
            name: "Материнские платы",
          },
        ],
      },
      {
        name: "Аксессуары для очков виртуальной реальности",
        subcategories: [],
      },
      {
        name: "Компьютерные кресла",
        subcategories: [],
      },
    ],
  },
  {
    name: "Умные колонки",
    subcategories: [
      {
        name: "Умные колонки VK",
        subcategories: [],
      },
      {
        name: "Умные колонки Xiaomi",
        subcategories: [],
      },
      {
        name: "Умные колонки Google",
        subcategories: [],
      },
      {
        name: "Умные колонки JBL",
        subcategories: [],
      },
      {
        name: "Умные колонки RAINBO",
        subcategories: [],
      },
      {
        name: "Умные колонки Harman/Kardon",
        subcategories: [],
      },
      {
        name: "Умные колонки Bose",
        subcategories: [],
      },
      {
        name: "Умные колонки Apple",
        subcategories: [],
      },
      {
        name: "Умные колонки Sonos",
        subcategories: [],
      },
      {
        name: "Умные колонки SBER",
        subcategories: [],
      },
      {
        name: "Умные колонки Amazon",
        subcategories: [],
      },
    ],
  },
  {
    name: "Гигиена",
    subcategories: [
      {
        name: "Умные колонки VK",
        subcategories: [],
      },
      {
        name: "Умные колонки Xiaomi",
        subcategories: [],
      },
      {
        name: "Умные колонки Google",
        subcategories: [],
      },
      {
        name: "Умные колонки JBL",
        subcategories: [],
      },
      {
        name: "Умные колонки RAINBO",
        subcategories: [],
      },
      {
        name: "Умные колонки Harman/Kardon",
        subcategories: [],
      },
      {
        name: "Умные колонки Bose",
        subcategories: [],
      },
      {
        name: "Умные колонки Apple",
        subcategories: [],
      },
      {
        name: "Умные колонки Sonos",
        subcategories: [],
      },
      {
        name: "Умные колонки SBER",
        subcategories: [],
      },
      {
        name: "Умные колонки Amazon",
        subcategories: [],
      },
    ],
  },
  {
    name: "Бытовая химия",
    subcategories: [
      {
        name: "Умные колонки VK",
        subcategories: [],
      },
      {
        name: "Умные колонки Xiaomi",
        subcategories: [],
      },
      {
        name: "Умные колонки Google",
        subcategories: [],
      },
      {
        name: "Умные колонки JBL",
        subcategories: [],
      },
      {
        name: "Умные колонки RAINBO",
        subcategories: [],
      },
      {
        name: "Умные колонки Harman/Kardon",
        subcategories: [],
      },
      {
        name: "Умные колонки Bose",
        subcategories: [],
      },
      {
        name: "Умные колонки Apple",
        subcategories: [],
      },
      {
        name: "Умные колонки Sonos",
        subcategories: [],
      },
      {
        name: "Умные колонки SBER",
        subcategories: [],
      },
      {
        name: "Умные колонки Amazon",
        subcategories: [],
      },
    ],
  },
  {
    name: "Зоотовары",
    subcategories: [
      {
        name: "Для птиц",
        subcategories: [
          {
            name: "Кормушки, поилки",
          },
          {
            name: "Наполнители",
          },
          {
            name: "Корма",
          },
          {
            name: "Лакомства",
          },
          {
            name: "Клетки",
          },
        ],
      },
      {
        name: "Для лошадей",
        subcategories: [
          {
            name: "Витамины и добавки для лошадей",
          },
        ],
      },
      {
        name: "Для собак",
        subcategories: [
          {
            name: "Сухие корма",
          },
          {
            name: "Влажные корма",
          },
          {
            name: "Лакомства",
          },
          {
            name: "Витамины и добавки",
          },
          {
            name: "Амуниция",
          },
        ],
      },
      {
        name: "Для грызунов и хорьков",
        subcategories: [
          {
            name: "Корма",
          },
          {
            name: "Лакомства",
          },
          {
            name: "Клетки и домики",
          },
          {
            name: "Сено и наполнители",
          },
          {
            name: "Поилки и кормушки",
          },
        ],
      },
      {
        name: "Фермерское хозяйство",
        subcategories: [
          {
            name: "Содержание с/х животных и птиц",
          },
          {
            name: "Товары для пчеловодства",
          },
          {
            name: "Инкубаторы",
          },
          {
            name: "Комбикорма",
          },
          {
            name: "Весы для животных",
          },
        ],
      },
      {
        name: "Для рыб и рептилий",
        subcategories: [
          {
            name: "Аквариумы",
          },
          {
            name: "Террариумы",
          },
          {
            name: "Оборудование для аквариумов и террариумов",
          },
          {
            name: "Декор для аквариумов и террариумов",
          },
          {
            name: "Корма",
          },
        ],
      },
      {
        name: "Ветаптека",
        subcategories: [
          {
            name: "Средства от блох и клещей",
          },
          {
            name: "Средства от глистов",
          },
          {
            name: "Витамины для животных и птиц",
          },
          {
            name: "Ветеринарные препараты",
          },
          {
            name: "Воротники и попоны",
          },
        ],
      },
    ],
  },
  {
    name: "Товары для взрослых",
    subcategories: [
      {
        name: "Стимуляторы",
        subcategories: [
          {
            name: "Стимуляторы эротические",
          },
          {
            name: "Эрекционные кольца",
          },
        ],
      },
      {
        name: "Косметика и парфюмерия",
        subcategories: [
          {
            name: "Интимная косметика и гигиена",
          },
          {
            name: "Интимная парфюмерия",
          },
          {
            name: "Средства возбуждающие",
          },
          {
            name: "Уход и хранение секс-игрушек и одежды",
          },
        ],
      },
      {
        name: "Одежда, белье, обувь",
        subcategories: [
          {
            name: "Комплекты нижнего белья",
          },
          {
            name: "Обувь",
          },
          {
            name: "Одежда, костюмы для женщин",
          },
          {
            name: "Одежда, костюмы для мужчин",
          },
          {
            name: "Аксессуары",
          },
        ],
      },
      {
        name: "Мебель, качели, подушки",
        subcategories: [
          {
            name: "Аксессуары для секса",
          },
          {
            name: "Мебель для секса",
          },
        ],
      },
      {
        name: "Интимные смазки",
        subcategories: [
          {
            name: "Интимные смазки",
          },
          {
            name: "Шприцы для интимной смазки",
          },
        ],
      },
      {
        name: "Мастурбаторы для мужчин",
        subcategories: [
          {
            name: "Аксессуары для мастурбаторов",
          },
          {
            name: "Мастурбаторы",
          },
        ],
      },
      {
        name: "BDSM-атрибутика",
        subcategories: [
          {
            name: "BDSM-атрибутика",
          },
          {
            name: "BDSM-наборы",
          },
          {
            name: "Атрибуты для бондажа и фиксации",
          },
          {
            name: "Ошейники, ремни, сбруи, поводки, аксессуары",
          },
          {
            name: "Расширители уретральные",
          },
        ],
      },
      {
        name: "Сувениры для взрослых",
        subcategories: [
          {
            name: "Сувенирная одежда 18+",
          },
          {
            name: "Сувениры 18+",
          },
          {
            name: "Съедобные сувениры 18+",
          },
        ],
      },
      {
        name: "Игры, книги, журналы",
        subcategories: [
          {
            name: "Игры и наборы 18+",
          },
          {
            name: "Печатная и видеопродукция 18+",
          },
        ],
      },
      {
        name: "Вагинальные и анальные вибраторы и стимуляторы",
        subcategories: [
          {
            name: "Вибраторы и аксессуары",
          },
          {
            name: "Стимуляторы анальные",
          },
          {
            name: "Стимуляторы и тренажеры вагинальные",
          },
          {
            name: "Страпоны и аксессуары",
          },
          {
            name: "Фаллоимитаторы и аксессуары",
          },
        ],
      },
      {
        name: "Секс-куклы",
        subcategories: [],
      },
      {
        name: "Вакуумные помпы",
        subcategories: [
          {
            name: "Комплектующие и аксессуары для помп",
          },
          {
            name: "Помпы вакуумные",
          },
        ],
      },
      {
        name: "Секс-машины",
        subcategories: [
          {
            name: "Аксессуары для секс-машин",
          },
          {
            name: "Насадки для секс-машины",
          },
          {
            name: "Секс-машины",
          },
        ],
      },
    ],
  },
  {
    name: "Оптика",
    subcategories: [
      {
        name: "Линзы для очков",
        subcategories: [],
      },
      {
        name: "Растворы для контактных линз",
        subcategories: [],
      },
      {
        name: "Очки",
        subcategories: [
          {
            name: "Очки для компьютера",
          },
          {
            name: "Очки для зрения",
          },
          {
            name: "Очки для водителей",
          },
          {
            name: "Очки для водителей и рыболовов",
          },
          {
            name: "Очки для зрения",
          },
        ],
      },
      {
        name: "Футляры",
        subcategories: [],
      },
      {
        name: "Капли для глаз",
        subcategories: [],
      },
      {
        name: "Оправы",
        subcategories: [],
      },
      {
        name: "Аксессуары",
        subcategories: [
          {
            name: "Аксессуары для контактных линз",
          },
          {
            name: "Аксессуары для ухода за очками",
          },
          {
            name: "Комплектующие для очков",
          },
        ],
      },
    ],
  },
  {
    name: "Ремёсла",
    subcategories: [
      {
        name: "Текстиль",
        subcategories: [
          {
            name: "Сувениры Яндекс Маркет",
          },
        ],
      },
      {
        name: "Интерьер",
        subcategories: [
          {
            name: "Статуэтки и фигурки",
          },
          {
            name: "Декоративная посуда",
          },
          {
            name: "Подсвечники и канделябры",
          },
          {
            name: "Шкатулки",
          },
          {
            name: "Вазы для цветов",
          },
        ],
      },
    ],
  },
  {
    name: "Цифровые товары",
    subcategories: [
      {
        name: "Игры для приставок и ПК",
        subcategories: [],
      },
      {
        name: "Игровая валюта",
        subcategories: [],
      },
      {
        name: "Онлайн-подписки",
        subcategories: [],
      },
      {
        name: "Программы",
        subcategories: [],
      },
      {
        name: "Цифровые книги",
        subcategories: [],
      },
      {
        name: "Карты пополнения счета",
        subcategories: [],
      },
      {
        name: "Тарифные планы и номера",
        subcategories: [],
      },
      {
        name: "Видеофильмы в электронном формате",
        subcategories: [],
      },
    ],
  },
  {
    name: "Оборудование",
    subcategories: [
      {
        name: "Оборудование для автосервисов",
        subcategories: [],
      },
      {
        name: "Рабочая одежда и обувь",
        subcategories: [
          {
            name: "Обувь",
          },
          {
            name: "Рабочие головные уборы",
          },
          {
            name: "Одежда",
          },
        ],
      },
      {
        name: "Оборудование для ремонта электроники",
        subcategories: [
          {
            name: "Мультиметры и тестеры",
          },
          {
            name: "Осциллографы",
          },
          {
            name: "Программаторы",
          },
          {
            name: "Радиодетали и электронные компоненты",
          },
          {
            name: "Запчасти для принтеров и МФУ",
          },
        ],
      },
      {
        name: "Строительство",
        subcategories: [
          {
            name: "Резчики швов и стенорезные машины",
          },
          {
            name: "Бетономешалки и растворосмесители",
          },
          {
            name: "Строительные вибраторы",
          },
          {
            name: "Сварочные аппараты",
          },
          {
            name: "Затирочные машины",
          },
        ],
      },
      {
        name: "Рекламные конструкции и информационные материалы",
        subcategories: [
          {
            name: "Рекламные конструкции и материалы",
          },
          {
            name: "Оформление ПВЗ Яндекс Маркет",
          },
          {
            name: "Информационные табло",
          },
          {
            name: "Предупредительные наклейки",
          },
        ],
      },
      {
        name: "Лабораторное оборудование",
        subcategories: [],
      },
      {
        name: "Оборудование для салонов красоты",
        subcategories: [
          {
            name: "Для маникюра и педикюра",
          },
          {
            name: "Для парикмахеров и барберов",
          },
          {
            name: "Для косметологов",
          },
          {
            name: "Тату оборудование",
          },
          {
            name: "Стерилизация для салонов красоты",
          },
        ],
      },
      {
        name: "Оборудование для прачечной и химчистки",
        subcategories: [],
      },
      {
        name: "Промышленное производство",
        subcategories: [
          {
            name: "Промышленные насосы",
          },
          {
            name: "Швейное производство",
          },
          {
            name: "Грузоподъемное оборудование",
          },
          {
            name: "Производственно-техническое оборудование",
          },
          {
            name: "Промышленные компьютеры",
          },
        ],
      },
      {
        name: "Чистящая и моющая техника",
        subcategories: [
          {
            name: "Промышленные пылесосы и парогенераторы",
          },
          {
            name: "Поломойные и подметальные машины",
          },
          {
            name: "Аксессуары и принадлежности",
          },
          {
            name: "Противогололедные реагенты",
          },
          {
            name: "Машинки для чистки обуви",
          },
        ],
      },
      {
        name: "Издательство и полиграфия",
        subcategories: [
          {
            name: "Контрольно-измерительное оборудование",
          },
          {
            name: "Полиграфическое оборудование",
          },
          {
            name: "Расходные материалы",
          },
          {
            name: "Режущие плоттеры",
          },
        ],
      },
      {
        name: "Оборудование для животноводства",
        subcategories: [
          {
            name: "Весы для животных",
          },
          {
            name: "Инкубаторы",
          },
        ],
      },
      {
        name: "Инструменты и расходные материалы для медучреждений",
        subcategories: [],
      },
      {
        name: "Охрана и безопасность",
        subcategories: [
          {
            name: "Сейфы",
          },
          {
            name: "Противопожарное оборудование и безопасность",
          },
          {
            name: "Системы видеонаблюдения",
          },
          {
            name: "Шлагбаумы и автоматика для ворот",
          },
          {
            name: "Средства индивидуальной бронезащиты",
          },
        ],
      },
      {
        name: "Пищевое оборудование",
        subcategories: [
          {
            name: "Изготовление мучных и кондитерских изделий",
          },
          {
            name: "Промышленные плиты",
          },
          {
            name: "Жарочные и пекарские шкафы",
          },
          {
            name: "Промышленные миксеры",
          },
          {
            name: "Пароконвектоматы",
          },
        ],
      },
      {
        name: "Сценическое и аудиооборудование",
        subcategories: [
          {
            name: "Оборудование для звукозаписывающих студий",
          },
          {
            name: "Концертное и трансляционное аудиооборудование",
          },
          {
            name: "Световое и сценическое оборудование",
          },
          {
            name: "Аксессуары для перевозки и хранения",
          },
          {
            name: "Коммутационное аудио- и видеооборудование",
          },
        ],
      },
      {
        name: "Банковское оборудование",
        subcategories: [
          {
            name: "Детекторы и счетчики банкнот",
          },
          {
            name: "Инкассация и опломбирование",
          },
        ],
      },
      {
        name: "Промышленное климатическое оборудование",
        subcategories: [],
      },
    ],
  },
  {
    name: "Уценка",
    subcategories: [
      {
        name: "Поделки",
        subcategories: [
          {
            name: "Поделки и аппликации",
          },
          {
            name: "3D-ручки",
          },
          {
            name: "Товары для декорирования",
          },
          {
            name: "Наклейки для творчества",
          },
          {
            name: "Выжигание и выпиливание",
          },
        ],
      },
      {
        name: "Вязание",
        subcategories: [
          {
            name: "Пряжа",
          },
          {
            name: "Спицы",
          },
          {
            name: "Крючки",
          },
          {
            name: "Наборы для вязания",
          },
          {
            name: "Инструменты и аксессуары",
          },
        ],
      },
      {
        name: "Декупаж",
        subcategories: [
          {
            name: "Лак и клей",
          },
          {
            name: "Наборы для декупажа",
          },
          {
            name: "Карты, салфетки, бумага",
          },
        ],
      },
      {
        name: "Наборы для опытов и исследований",
        subcategories: [
          {
            name: "Наборы для исследований",
          },
          {
            name: "Детские микроскопы и телескопы",
          },
        ],
      },
      {
        name: "Шитье и вышивание",
        subcategories: [
          {
            name: "Ткани, кожа и замша",
          },
          {
            name: "Канва и наборы для вышивания",
          },
          {
            name: "Инструменты и аксессуары",
          },
          {
            name: "Декоративные элементы",
          },
          {
            name: "Нитки, мулине, шнуры",
          },
        ],
      },
      {
        name: "Сборные модели и аксессуары",
        subcategories: [
          {
            name: "Сборные модели",
          },
          {
            name: "Румбоксы",
          },
          {
            name: "Аксессуары",
          },
        ],
      },
      {
        name: "Лепка",
        subcategories: [
          {
            name: "Пластилин и масса для лепки",
          },
          {
            name: "Гипс для литья и лепки",
          },
          {
            name: "Глина для лепки",
          },
          {
            name: "Кинетический песок",
          },
          {
            name: "Инструменты для лепки",
          },
        ],
      },
      {
        name: "Скрапбукинг",
        subcategories: [
          {
            name: "Бумага и наборы",
          },
          {
            name: "Украшения и декоративные элементы",
          },
          {
            name: "Инструменты и аксессуары",
          },
        ],
      },
      {
        name: "Пазлы и головоломки",
        subcategories: [
          {
            name: "Пазлы",
          },
          {
            name: "Головоломки",
          },
        ],
      },
      {
        name: "Рукоделие",
        subcategories: [
          {
            name: "Алмазная мозаика",
          },
          {
            name: "Валяние",
          },
          {
            name: "Квиллинг",
          },
        ],
      },
      {
        name: "Бисер и создание украшений",
        subcategories: [
          {
            name: "Наборы для создания украшений",
          },
          {
            name: "Фурнитура для украшений",
          },
        ],
      },
      {
        name: "Изготовление мыла, свечей, косметики",
        subcategories: [
          {
            name: "Изготовление свечей",
          },
          {
            name: "Мыльная основа, краситель, отдушка",
          },
          {
            name: "Изготовление косметики",
          },
          {
            name: "Формы для мыла",
          },
          {
            name: "Наборы для мыловарения",
          },
        ],
      },
    ],
  },
]);

const selectedCategory = ref(null);
const categoryDropdown = ref(null);

const selectCategory = (categories: any, index) => {
  store.createProducts[index].category = categories;
  categoryDropdown.value.click();
};
</script>

<template>
  <tr class="bg-base-100">
    <!-- <td class="hidden 3xl:block text-center mt-9">
      {{ index + 1 }}
    </td> -->
    <td class="border-r border-base">
      <div
        style="
          width: 28px;
          height: 36px;
          overflow: visible;
          position: relative;
          border-radius: 4px;
        "
      >
        <div class="dropdown dropdown-hover dropdown-right">
          <label tabindex="0">
            <nuxt-img
              class="rounded-lg"
              loading="lazy"
              fit="fill"
              :src="product.image"
            />
          </label>
          <ul
            tabindex="0"
            class="dropdown-content mt-4 p-2 shadow bg-base-100 rounded-box w-52 z-10"
          >
            <nuxt-img
              class="rounded-lg"
              loading="lazy"
              fit="fill"
              :src="product.image"
            />
          </ul>
        </div>
      </div>
    </td>
    <td class="border-r border-base text-center">
      <div class="w-48 truncate text-center flex flex-col justify-center">
        <div class="text-sm font-normal truncate text-center">
          {{ product.name }}
        </div>
        <div class="text-center">
          <a
            :href="product.url"
            target="_blank"
            class="text-sm text-primary link link-hover text-center"
          >
            {{ product.article }}
          </a>
        </div>
      </div>
    </td>
    <td class="border-r border-base text-center">
      <div class="text-sm text-center w-full">
        {{ product.priceText }}
      </div>
    </td>
    <!-- <td class="border-r border-base">
      <div class="relative flex items-center flex-grow-0 w-full">
        <div
          class="absolute left-0 btn btn-ghost btn-sm btn-square"
          @click="productQuantityModel--"
        >
          <Icon size="16" name="ic:round-minus" />
        </div>
        <input
          v-model="productQuantityModel"
          type="number"
          min="1"
          max="1000"
          class="input input-sm w-full text-center bg-base-300 bg-opacity-40"
        />
        <div
          class="absolute right-0 btn btn-ghost btn-sm btn-square"
          @click="productQuantityModel++"
        >
          <Icon size="16" name="ic:round-plus" />
        </div>
      </div>
    </td> -->
    <td class="border-r border-base">
      <div class="w-20 2xl:w-full flex items-center">
        <select
          v-if="product.sizes.length"
          class="select select-sm w-full bg-[#F3E9DD]"
          @change="onSizeChange"
        >
          <option
            v-for="size in product.sizes"
            :key="size"
            :selected="product.selectedSize === size"
            :value="size"
          >
            {{ size }}
          </option>
        </select>
        <div v-else class="text-sm text-center ml-2">Нет</div>
      </div>
    </td>
    <td class="border-r border-base">
      <div class="w-20 2xl:w-full">
        <select
          class="select select-sm w-full bg-[#F3E9DD] max-w-sm appearance-none"
          @change="onSexChange"
        >
          <option value="Нет">Нет</option>
          <option value="male">Муж</option>
          <option value="female">Жен</option>
        </select>
      </div>
    </td>
    <td class="border-r border-base">
      <div class="w-full flex items-center justify-center gap-2">
        <div class="my-auto">
          {{
            product.rules.length
              ? product.rules.map((rule: Rule) => rule.id).join(", ")
              : ""
          }}
        </div>
        <button
          class="border-base-100 text-[#96959a] dark:text-base-content dark:text-opacity-40"
          @click="$emit('ruleModalOpen', index)"
        >
          <Icon name="mdi:settings" size="20" />
        </button>
      </div>
    </td>
    <td class="border-r border-base">
      <div class="flex items-center mt-2">
        <div class="w-full">
          <BuyoutDateRangePicker
            v-if="!product.purchaseSoon"
            v-model="productDateRangeModel"
            :start-date="startDate"
          />
          <div v-else class="text-center">Выкуп в ближайшее время</div>
        </div>
      </div>
    </td>
    <td class="break-all max-w-[170px] border-r border-base">
      <div
        class="w-full flex flex-col items-center gap-1 flex-wrap overflow-hidden justify-center"
      >
        <div
          v-if="product.adress"
          class="text-xs max-h-18 w-full break-all text-center"
        >
          <span v-show="loading" class="loading loading-spinner" />
          <p
            v-if="!loading"
            @click="$emit('pointModalOpen', index)"
            class="break-all whitespace-normal cursor-pointer text-primary"
          >
            {{ product.adress }}
          </p>
        </div>
        <button
          v-if="!product.adress"
          :disabled="loading"
          :class="{
            'btn-outline': product.adress,
          }"
          class="btn btn-sm normal-case rounded-full p-1.5 bg-[#F3E9DD] dark:bg-primary dark:bg-opacity-10 border-none w-fit"
          @click="$emit('pointModalOpen', index)"
        >
          <span v-show="loading" class="loading loading-spinner" />
          <Icon v-if="!loading" name="fluent:add-24-filled" size="20" />
        </button>
        <!-- <button
          v-if="product.adress"
          :disabled="loading"
          :class="{
            'btn-outline': product.adress,
          }"
          class="btn btn-primary btn-sm normal-case w-full"
          @click="$emit('pointModalOpen', index)"
        >
          <span v-show="loading" class="loading loading-spinner" />
          <span v-if="!loading">Изменить </span>
          
        </button> -->
      </div>
    </td>

    <td class="border-r border-base">
      <div class="w-full flex gap-2" v-if="user.username == 'test'">
        <details class="dropdown">
          <summary
            class="btn m-1 text-sm z-1"
            ref="categoryDropdown"
            style="z-index: 1 !important"
          >
            {{
              store.createProducts[props.index].category &&
              store.createProducts[props.index].category.length
                ? store.createProducts[props.index].category.join(" > ")
                : "Выбрать категорию"
            }}
          </summary>
          <ul
            style="z-index: 9999 !important"
            tabindex="0"
            class="dropdown-content rounded-box z-1 w-52 p-2 shadow-sm"
          >
            <button
              class="btn btn-sm btn-square relative left-1 -top-1 z-50"
              @click="categoryDropdown.click()"
            >
              <Icon name="material-symbols:close-rounded" size="18" />
            </button>
            <div
              class="overflow-y-auto bg-base-100 rounded-md -mt-10 fixed drop-shadow-lg pl-1"
              style="max-height: 400px; width: 500px"
            >
              <BuyoutCategoryTreeSelect
                :categories="categories"
                @select-category="selectCategory($event, index)"
              />
            </div>
          </ul>
        </details>
        <button
          class="btn btn-sm btn-square mt-3 -ml-2.5"
          v-if="product.category"
          @click="product.category = null"
        >
          <Icon name="material-symbols:close-rounded" size="18" />
        </button>
      </div>
      <div v-else>
        <button class="btn" disabled>Выберите категорию</button>
      </div>
    </td>
    <td class="border-r border-base">
      <div class="w-full flex flex-col gap-2">
        <BuyoutYandexMarketCreateSearchQueries
          :product-index="props.index"
          :article="product.article"
          :queries="product.searchQuery"
          @update="productSearchQueryUpdate"
          @add="addSearchQuery"
          @remove="removeSearchQuery"
        />
      </div>
    </td>
    <td class="w-[140px] border-r border-base">
      <div class="flex justify-center mt-1">
        <button
          v-if="!product.promoCode"
          class="btn btn-sm normal-case rounded-full p-1.5 bg-[#F3E9DD] dark:bg-primary dark:bg-opacity-10 border-none"
          @click="props.openPromo(index, product.price)"
        >
          <Icon
            v-if="!product.promoCode"
            name="fluent:add-24-filled"
            size="20"
          />
        </button>
        <span
          @click="props.openPromo(index, product.price)"
          class="break-all whitespace-nowrap cursor-pointer text-primary mt-2"
          >{{ product.promoCode }}</span
        >
        <button
          v-if="product.promoCode"
          class="btn btn-sm normal-case rounded-full ml-0.5 bg-[#F3E9DD] dark:bg-primary dark:bg-opacity-10 border-none w-fit h-fit"
          @click="$emit('removePromo', index)"
        >
          <Icon name="ep:close-bold" size="12" />
        </button>
      </div>
    </td>
    <td class="border-r border-base w-[90px]">
      <div class="flex justify-end">
        <div
          class="w-8 btn btn-ghost btn-sm btn-square text-[#8f8e93] dark:text-base-300 hover:text-primary"
          @click="deleteBuyOut"
        >
          <Icon name="material-symbols:close" size="20" />
        </div>
        <div
          class="w-8 btn btn-ghost btn-sm btn-square text-[#8f8e93] dark:text-base-300 hover:text-primary"
          @click="copyBuyout"
        >
          <Icon
            name="material-symbols:content-copy-outline-rounded"
            size="20"
          />
        </div>
      </div>
    </td>
  </tr>
</template>

<style scoped></style>
