import { getServerSession } from '#auth'
import request from 'request'
const config = useRuntimeConfig()
const proxy = config.CHANGING_PROXY
const elPerPage = 50
const apiKey = config.serverLoadApiKey

export default eventHandler(async (event) => {
  const session = (await getServerSession(event)) as any
  if (!session) return sendRedirect(event, '/auth', 302)

  const { article, limit, page } = getQuery(event)

  if (!article) {
    return send(event, {
      status: 400,
      body: 'Article is required',
    })
  }

  const data: any = await $fetch('http://95.163.249.133:4141', {
    method: 'POST',
    parseResponse: JSON.parse,
    body: {
      type: 'ozonQuestions',
      url: `https://www.ozon.ru/product/${article}/`,
      count: elPerPage,
    },
  })

  if (!data || data.status === 'error') {
    return {
      feedbacks: [],
      feedbacksCount: 0,
    }
  }

//  const data = [
//     {
//         "id": 190819859,
//         "question": {
//             "author": "Пользователь предпочёл скрыть свои данные",
//             "text": "Срок годности уточните?",
//             "createdAt": "5 декабря 2022",
//             "likes": 2
//         },
//         "answers": [
//             {
//                 "id": "191507524",
//                 "author": "эльмира с.",
//                 "text": "До 10.2025",
//                 "createdAt": "10 декабря 2022",
//                 "likes": 4,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 197367267,
//         "question": {
//             "author": "Резеда Щ.",
//             "text": "Подскажите, предварительно не нужно мыть голову для использования справа?",
//             "createdAt": "7 февраля 2023",
//             "likes": 1
//         },
//         "answers": [
//             {
//                 "id": "200535173",
//                 "author": "OZON",
//                 "text": "Добрый день, Резеда! Способ применения данного скраба:\nНанесите на влажную кожу головы, слегка массируя, и оставьте на 3 минуты, затем смойте большим количеством воды. После этой процедуры помойте волосы шампунем. Для лучшего результата используйте один раз в неделю.",
//                 "createdAt": "6 марта 2023",
//                 "likes": 8,
//                 "dislikes": 0
//             },
//             {
//                 "id": "197375411",
//                 "author": "Константин П.",
//                 "text": "Нет. Мыть после применения средства",
//                 "createdAt": "7 февраля 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 210507688,
//         "question": {
//             "author": "Анна Г.",
//             "text": "Добрый день, это скраб на основе соли?",
//             "createdAt": "25 мая 2023",
//             "likes": 1
//         },
//         "answers": [
//             {
//                 "id": "210640220",
//                 "author": "OZON",
//                 "text": "Добрый день, Анна! Состав: Aqua, Sodium Сосо-Sulfate, Pinus SibiriСa Shell Powder, Lauryl GluСoside, AСrylates Сopolymer, СoСamidopropyl Betaine, Sodium Сhloride, Rubus Idaeus (Raspberry) Seed Powder, Hippophae Rhaimnoidesamidopropyl BetaineHR, Hippophae Rhamnoides Fruit Oil*, Menthol, Argania Spinosa Seed Oil*, Pineamydopropyl BetainePS, GlyСeryl UndeСylenate, GlyСoliС AСid, Mentha Piperita (Peppermint) Leaf Water*, Сalendula OffiСinalis Flower ExtraСt*, Bisabolol, AСhillea AsiatiСa ExtraСtWH, ArСtium Lappa Root ExtraСt*, Oxalis Tetraphylla ExtraСt, СitriС AСid, UrtiСa DioiСa Leaf ExtraСt*, Geranium SibiriСum ExtraСtWH, Juniperus SibiriСa ExtraСtWH, Sodium AsСorbyl Phosphate, ToСopherol, Rethinyl Palmitate, Sodium Hydroxide, Sodium PСA, Sodium LaСtate, Arginine, AspartiС AСid, PСA, GlyСine, Alanine, Serine, Valine, Proline, Threonine, IsoleuСine, Histidine, Phenylalanine, Parfum, Benzyl AlСohol, EthylhexylglyСerin, СI 16255, Сaramel, СI 15985. * - органические ингредиенты. WH - органические экстракты дикорастущих растений Сибири. PS - производное масла сибирского кедра. HR - производное масла алтайской облепихи.",
//                 "createdAt": "26 мая 2023",
//                 "likes": 1,
//                 "dislikes": 13
//             },
//             {
//                 "id": "210514759",
//                 "author": "Пит",
//                 "text": "Вроде в составе ничего про соль на русском не написано, у производителя есть другие скрабы, подписанные как \"соляные\".",
//                 "createdAt": "25 мая 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 215149933,
//         "question": {
//             "author": "Мадина П.",
//             "text": "Скраб пенится??",
//             "createdAt": "25 июня 2023",
//             "likes": 1
//         },
//         "answers": [
//             {
//                 "id": "215330679",
//                 "author": "OZON",
//                 "text": "Добрый день, Мадина! Да, скраб хорошо пенится.",
//                 "createdAt": "28 июня 2023",
//                 "likes": 1,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215806258",
//                 "author": "Игрушки",
//                 "text": "да",
//                 "createdAt": "28 июня 2023",
//                 "likes": 1,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215695812",
//                 "author": "Пит",
//                 "text": "Если пенить руками, то пенится, пена появляется. Если сильно не массировать, то не особо. Вроде так.",
//                 "createdAt": "29 июня 2023",
//                 "likes": 1,
//                 "dislikes": 0
//             },
//             {
//                 "id": "264105345",
//                 "author": "Иван К.",
//                 "text": "Скраб пенится.",
//                 "createdAt": "6 апреля 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215806367",
//                 "author": "Игрушки",
//                 "text": "да",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215640502",
//                 "author": "Анастасия К.",
//                 "text": "Немного",
//                 "createdAt": "29 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215615091",
//                 "author": "Жданова Дарья",
//                 "text": "Пенится не сильно. Отлично смывает масла и маски",
//                 "createdAt": "29 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215601395",
//                 "author": "Елена Б.",
//                 "text": "да пениться",
//                 "createdAt": "29 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215600336",
//                 "author": "Елена Б.",
//                 "text": "да",
//                 "createdAt": "29 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215591978",
//                 "author": "Татьяна Н.",
//                 "text": "скраб очень хороший, после применения шампунь легко наносится все пенится. Супер",
//                 "createdAt": "29 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215496585",
//                 "author": "Анна",
//                 "text": "Да, очень приятная текстура)",
//                 "createdAt": "29 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215428286",
//                 "author": "ПД УДАЛЕНЫ",
//                 "text": "Да, достаточно пенится!",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215373891",
//                 "author": "Елена Ж.",
//                 "text": "Отлично пенится",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215364529",
//                 "author": "Елена Ж.",
//                 "text": "Очень хорошо пенится",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215357898",
//                 "author": "домохозяйка",
//                 "text": "да",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215291183",
//                 "author": "Иван К.",
//                 "text": "Да, незначительно пенится.",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215267381",
//                 "author": "Елена П.",
//                 "text": "Немного",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215248339",
//                 "author": "Кристина А.",
//                 "text": "да",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215239758",
//                 "author": "Ильмира А.",
//                 "text": "да",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215237439",
//                 "author": "Ксения Н.",
//                 "text": "Да, пениться.",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "215224246",
//                 "author": "Елена Л.",
//                 "text": "Если нанести на влажную кожу головы и массировать- то пениться, но не очень сильно",
//                 "createdAt": "28 июня 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 217081649,
//         "question": {
//             "author": "Анастасия Т.",
//             "text": "Подходит для окрашенных волос?",
//             "createdAt": "7 июля 2023",
//             "likes": 1
//         },
//         "answers": [
//             {
//                 "id": "217290760",
//                 "author": "OZON",
//                 "text": "Добрый день, Анастасия! Средство подходит для всех типов волос.",
//                 "createdAt": "9 июля 2023",
//                 "likes": 1,
//                 "dislikes": 0
//             },
//             {
//                 "id": "217083322",
//                 "author": "Пит",
//                 "text": "Не указано - но в этом плане все скрабы примерно одинаковые, могут несколько повлиять на недавно крашеные волосы.",
//                 "createdAt": "7 июля 2023",
//                 "likes": 1,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 218490658,
//         "question": {
//             "author": "Пользователь предпочёл скрыть свои данные",
//             "text": "Здравствуйте, подойдет если умеренно выпадают волосы?",
//             "createdAt": "18 июля 2023",
//             "likes": 1
//         },
//         "answers": [
//             {
//                 "id": "218658594",
//                 "author": "OZON",
//                 "text": "Добрый день! Данное средство укрепляет волосяные луковицы. Стимулирует рост волос. Препятствует появлению перхоти.",
//                 "createdAt": "19 июля 2023",
//                 "likes": 3,
//                 "dislikes": 2
//             },
//             {
//                 "id": "218577667",
//                 "author": "На Ф.",
//                 "text": "Здравствуйте! Это вопрос к трихологу, вообще средство классное, как и вся линия!",
//                 "createdAt": "18 июля 2023",
//                 "likes": 1,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 258460142,
//         "question": {
//             "author": "Пользователь предпочёл скрыть свои данные",
//             "text": "Добрый день. У вас указано,что при покупке двух товаров оплата только за один. В корзине конечная сумма в итоге выходит за 2шт при добавлении двух скрабов.",
//             "createdAt": "10 марта 2024",
//             "likes": 2
//         },
//         "answers": [
//             {
//                 "id": "259222032",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. К сожалению, акция 2=1 временно была приостановлена из-за технического сбоя. На данный момент были приняты все необходимые меры и акция восстановлена. Приносим свои извинения  за предоставленные неудобства. Надеемся эта проблема не отразится на выборе нашей продукции и на компании в целом.  Спасибо, что выбираете наш бренд. Надеемся и впредь радовать Вас нашей продукцией.  С уважением, представитель бренда.",
//                 "createdAt": "13 марта 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 258505345,
//         "question": {
//             "author": "Елена К.",
//             "text": "Акция 2=1. Почему при заказе 2х единиц товара удваивается цена? А как же акция???",
//             "createdAt": "10 марта 2024",
//             "likes": 2
//         },
//         "answers": [
//             {
//                 "id": "259218343",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. К сожалению, акция 2=1 временно была приостановлена из-за технического сбоя. На данный момент были приняты все необходимые меры и акция восстановлена. Приносим свои извинения  за предоставленные неудобства. Надеемся эта проблема не отразится на выборе нашей продукции и на компании в целом.  Спасибо, что выбираете наш бренд. Надеемся и впредь радовать Вас нашей продукцией.  С уважением, представитель бренда.",
//                 "createdAt": "13 марта 2024",
//                 "likes": 1,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 262751307,
//         "question": {
//             "author": "Полина Г.",
//             "text": "есть ли акция 2 по цене 1?",
//             "createdAt": "31 марта 2024",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "263757823",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. На данный момент акция закончилась. Мы всегда стараемся предложить нашим покупателям лучшие условия и возможность приобрести качественные товары по более выгодным ценам. Это отличная возможность для вас попробовать что-то новое или запастись любимыми товарами, сэкономив при этом. Надеемся, что вы сможете воспользоваться нашим предложением и оцените высокое качество продукции! С уважением, представитель бренда.",
//                 "createdAt": "4 апреля 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 263495636,
//         "question": {
//             "author": "Александр М.",
//             "text": "Написано 199р вместо 599р, а в итоге стоимость 250р, как это понимать?",
//             "createdAt": "3 апреля 2024",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "263525976",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. Сроки проведения акции выделены в карточке товара. С 17-30 апреля. С уважением, представитель бренда.",
//                 "createdAt": "3 апреля 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 234512261,
//         "question": {
//             "author": "Пользователь предпочёл скрыть свои данные",
//             "text": "Здравствуйте, будет ли ещё скраб?",
//             "createdAt": "5 ноября 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "234827571",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "В дополнении, рекомендуем обратить внимание на Скраб для кожи головы OBLEPIKHA SIBERICA PROFESSIONAL Глубокое очищение. Он прекрасно очищает и регенерирует кожу головы, устраняет ороговевший эпидермис удаляет загрязнения и остатки средств для укладки. Дарит длительное ощущение свежести и чистоты.\n С уважением, представитель бренда.",
//                 "createdAt": "7 ноября 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "234826138",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день! \nБлагодарим вас за интерес к нашим средствам. Товар совсем скоро будет в наличии — не забудьте добавить его в лист ожидания, чтобы получить уведомление о поступлении.    С уважением, представитель бренда",
//                 "createdAt": "7 ноября 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 234726616,
//         "question": {
//             "author": "Пользователь предпочёл скрыть свои данные",
//             "text": "Будет ли ещё поставка?",
//             "createdAt": "6 ноября 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "234832076",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день! \nБлагодарим вас за интерес к  нашей продукции. Чтобы отследить когда данное средство будет в наличии, не забудьте добавить его в лист ожидания, чтобы получить уведомление о поступлении.    С уважением, представитель бренда",
//                 "createdAt": "7 ноября 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 244281267,
//         "question": {
//             "author": "Пользователь предпочёл скрыть свои данные",
//             "text": "Что значит 2 товара по цене одного? За 270 руб придет 2 упаковки скраба?",
//             "createdAt": "22 декабря 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "244930581",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. Абсолютно верно. Если вы в подарок выбрали именно это средство, то в корзину откладываете себе 2  средства, а при оформлении платите за 1. Акция распространяется на товары из подборки, нужно самостоятельно выбрать любой продукт, чтобы акция сработала. Это может быть шампунь, бальзам или любой другое средство из подборки. Чтобы увидеть все товары, участвующие в акции, нужно нажать на плашку \"\"1=2\"\" в карточке товара. С уважением, представитель бренда.",
//                 "createdAt": "26 декабря 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "244371225",
//                 "author": "Александра К.",
//                 "text": "Да, только не забудьте в корзине добавить вторую упаковку",
//                 "createdAt": "23 декабря 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 245996214,
//         "question": {
//             "author": "Пользователь предпочёл скрыть свои данные",
//             "text": "Подскажите состав самих скрабирующих частиц? По видео напоминают абрикосовые косточки из 2000х)",
//             "createdAt": "4 января 2024",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "247166765",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. В составе средства порошок кедрового ореха и малиновых косточек. С уважением, представитель бренда.",
//                 "createdAt": "10 января 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "246867390",
//                 "author": "Ирина М.",
//                 "text": "Люди добрые! Что же вы состав не читаете? Там же написано о косточках малины.",
//                 "createdAt": "9 января 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 250526345,
//         "question": {
//             "author": "Анастасия Р.",
//             "text": "Подскажите, этот скраб вместо пилинга? Такими же функциями обладает?",
//             "createdAt": "28 января 2024",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "250765508",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. По сути, пилинг и скраб решают одну и ту же задачу – очищение мертвых клеток с кожного покрова. \nОднако скраб, благодаря входящим в состав абразивным частицам ещё и стимулирует кровообращение, что улучшает состояние луковиц и способствует росту волос. С уважением, представитель бренда.",
//                 "createdAt": "29 января 2024",
//                 "likes": 1,
//                 "dislikes": 0
//             },
//             {
//                 "id": "250586454",
//                 "author": "Ирина М.",
//                 "text": "Да)",
//                 "createdAt": "29 января 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 257739639,
//         "question": {
//             "author": "Пользователь предпочёл скрыть свои данные",
//             "text": "Здравствуйте, можно ли использовать скраб после пилинга?",
//             "createdAt": "6 марта 2024",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "257909703",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. Не рекомендуется одновременно использовать и скраб и пилинг. Рекомендуем чередовать средства через день. Один день одно средство, через день-два другое. Чтобы не перегрузить сальные железы.  С уважением, представитель бренда.",
//                 "createdAt": "6 марта 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 257933661,
//         "question": {
//             "author": "Анна Б.",
//             "text": "Здравствуйте. Должна ли присутствовать фольгированная мембрана на тюбике?",
//             "createdAt": "7 марта 2024",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "258652729",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. Фольгированной мембраны на тюбики нет. При этом на крышке присутствует пленка для защиты от вскрытия.   С уважением, представитель бренда.",
//                 "createdAt": "11 марта 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "258373257",
//                 "author": "avatar69m",
//                 "text": "На самом носике фольги нет. Контроль вскрытия обеспечивает пленка, которую надо удалить чтобы открыть крышечку.",
//                 "createdAt": "9 марта 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 258247603,
//         "question": {
//             "author": "Ольга Ш.",
//             "text": "Доброе утро! Сейчас идет акция 2 по цене одного?",
//             "createdAt": "9 марта 2024",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "258723998",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. К сожалению, акция 2=1 временно была приостановлена из-за технического сбоя. На данный момент были приняты все необходимые меры и акция восстановлена. Приносим свои извинения  за предоставленные неудобства. Надеемся эта проблема не отразится на выборе нашей продукции и на компании в целом.  Спасибо, что выбираете наш бренд. Надеемся и впредь радовать Вас нашей продукцией.  С уважением, представитель бренда.",
//                 "createdAt": "11 марта 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "258372594",
//                 "author": "avatar69m",
//                 "text": "Да, сегодня 9.03.24 еще идет.",
//                 "createdAt": "9 марта 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 258752316,
//         "question": {
//             "author": "Екатенина Б.",
//             "text": "Здравствуйте, если акция 2=1, то почему при добавлении в корзину 2 продукта, цена увеличивается (222₽ 1 единица товара, 444₽ 2 единицы товара)? На самом деле никакой акции нет?",
//             "createdAt": "11 марта 2024",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "258758736",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. К сожалению, акция 2=1 временно была приостановлена из-за технического сбоя. На данный момент были приняты все необходимые меры и акция восстановлена. Приносим свои извинения  за предоставленные неудобства. Надеемся эта проблема не отразится на выборе нашей продукции и на компании в целом.  Спасибо, что выбираете наш бренд. Надеемся и впредь радовать Вас нашей продукцией.  С уважением, представитель бренда.",
//                 "createdAt": "11 марта 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 259613259,
//         "question": {
//             "author": "Алёна К.",
//             "text": "Добрый вечер. А будет ещё акция 2=1 или нет? Я ко дню рождения сохранила полную корзину товаров по акции так как было написано, что акция до 24 марта, сегодня хотела оформить заказ, но акция внезапно закончилась((((",
//             "createdAt": "15 марта 2024",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "260221382",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. Извините за неудобства, акция временно приостановлена. Мы пока не можем предоставить информацию о возможной дате возобновления. Благодарим за понимание. С уважением, представитель бренда.",
//                 "createdAt": "18 марта 2024",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 190824305,
//         "question": {
//             "author": "Лариса Ф.",
//             "text": "товар оригинальный ?",
//             "createdAt": "5 декабря 2022",
//             "likes": 4
//         },
//         "answers": [
//             {
//                 "id": "191507531",
//                 "author": "эльмира с.",
//                 "text": "Да, оригинальный",
//                 "createdAt": "10 декабря 2022",
//                 "likes": 1,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 191909905,
//         "question": {
//             "author": "Дарья Л.",
//             "text": "Здравствуйте, для жирной кожи головы подойдёт?",
//             "createdAt": "15 декабря 2022",
//             "likes": 1
//         },
//         "answers": [
//             {
//                 "id": "191975061",
//                 "author": "Ирина П.",
//                 "text": "да",
//                 "createdAt": "15 декабря 2022",
//                 "likes": 1,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 207428953,
//         "question": {
//             "author": "Лиля Н.",
//             "text": "Каким образом сделать кожу головы влажной?",
//             "createdAt": "30 апреля 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "207606726",
//                 "author": "OZON",
//                 "text": "Добрый день, Лиля! Для этого вам понадобится не большое количество проточной воды.",
//                 "createdAt": "2 мая 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "207431417",
//                 "author": "Сергей Л.",
//                 "text": "пробежка поможет",
//                 "createdAt": "30 апреля 2023",
//                 "likes": 3,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 208229055,
//         "question": {
//             "author": "Парвана а.",
//             "text": "Здравствуйте! А для беременных можно пользоваться?",
//             "createdAt": "7 мая 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "208383564",
//                 "author": "OZON",
//                 "text": "Добрый день, Полина! Рекомендуем проконсультироваться со специалистом.",
//                 "createdAt": "8 мая 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "208394209",
//                 "author": "Пит",
//                 "text": "На упаковке нет указаний о запрете использования беременными. Вообще косметику и средства гигиены на беременных редко тестируют - слишком дорого.",
//                 "createdAt": "8 мая 2023",
//                 "likes": 1,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 218555506,
//         "question": {
//             "author": "Анастасия О.",
//             "text": "Когда заканчивается срок годности?",
//             "createdAt": "18 июля 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "218678707",
//                 "author": "OZON",
//                 "text": "Добрый день, Анастасия! Точная информация по сроку годности указана на упаковке.",
//                 "createdAt": "19 июля 2023",
//                 "likes": 1,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 220335397,
//         "question": {
//             "author": "Пользователь предпочёл скрыть свои данные",
//             "text": "Смывает ли краску? Подойдёт на окрашенные волосы?",
//             "createdAt": "31 июля 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "220425006",
//                 "author": "OZON",
//                 "text": "Добрый день! Подходит для всех типов волос.",
//                 "createdAt": "1 августа 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "220338082",
//                 "author": "Пит",
//                 "text": "Насколько мне сказали - примерно также, как другие скрабы. Может немного повлиять на свежепокрашенные. Но я сам не крашусь, не проверял.",
//                 "createdAt": "31 июля 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 224669559,
//         "question": {
//             "author": "Лиля К.",
//             "text": "Здравствуйте. Уточните, пожалуйста, срок годности скраба",
//             "createdAt": "5 сентября 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "224966402",
//                 "author": "OZON",
//                 "text": "Добрый день, Лиля! Срок годности товара - 3 года. Остаточный срок годности зависит от партии товара и составляет не менее 6 мес.",
//                 "createdAt": "7 сентября 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             },
//             {
//                 "id": "224684535",
//                 "author": "Екатерина Т.",
//                 "text": "почти 2 года",
//                 "createdAt": "5 сентября 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 224993358,
//         "question": {
//             "author": "Пользователь предпочёл скрыть свои данные",
//             "text": "Почему приходит старый дизайн?",
//             "createdAt": "7 сентября 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "225118106",
//                 "author": "OZON",
//                 "text": "Добрый день! Информация о технических характеристиках, комплекте поставки, стране изготовления, внешнем виде и цвете товара носит справочный характер и основывается на последних доступных к моменту публикации сведениях.",
//                 "createdAt": "8 сентября 2023",
//                 "likes": 0,
//                 "dislikes": 2
//             }
//         ]
//     },
//     {
//         "id": 227624058,
//         "question": {
//             "author": "Татьяна Г.",
//             "text": "С какого возраста можно применять?",
//             "createdAt": "26 сентября 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "227729843",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. Данное средство можно использовать с 18 лет. При желании можно получить консультацию дерматолога. \nС уважением, представитель бренда.",
//                 "createdAt": "27 сентября 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     },
//     {
//         "id": 229891295,
//         "question": {
//             "author": "Дарья П.",
//             "text": "Здравствуйте! Для сухой кожи головы можно применять?",
//             "createdAt": "11 октября 2023",
//             "likes": 0
//         },
//         "answers": [
//             {
//                 "id": "229933001",
//                 "author": "ООО Натура Сиберика - завод-производитель",
//                 "text": "Добрый день. Благодарим Вас за интерес к нашему бренду. В составе средства соль, которая обладает подсушивающим действием. Для  сухой кожи головы лучше использовать пилинги. Обратите внимание на:\n1. Пилинг детокс для кожи головы профессиональный REFRESH MY SCALP BIO PEELING от ICE PROFESSIONAL by NATURA SIBERICA.\n2. Пилинг для кожи головы профессиональный Hair Growth от ICE by NATURA SIBERICA\n3. Natura Siberica Hair Evolution Пилинг-активатор для кожи головы RE-GROW Укрепление & рост волос",
//                 "createdAt": "11 октября 2023",
//                 "likes": 0,
//                 "dislikes": 0
//             }
//         ]
//     }
// ]

data.forEach((feedback: any) => {
    feedback.answers.forEach((answers: any) => {
      answers.addLikes = 0
      answers.addDislikes = 0
    })
  })


  return {
    feedbacks: data,
    feedbacksCount: 0,
  }
})
